
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第九章 區塊鏈 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="第十章.html" />
    
    
    <link rel="prev" href="第八章.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="前言.html">
            
                <a href="前言.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="術語.html">
            
                <a href="術語.html">
            
                    
                    術語
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="第一章.html">
            
                <a href="第一章.html">
            
                    
                    第一章 概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="第二章.html">
            
                <a href="第二章.html">
            
                    
                    第二章 比特幣如何運作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="第三章.html">
            
                <a href="第三章.html">
            
                    
                    第三章 Bitcoin Core參考實現
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="第四章.html">
            
                <a href="第四章.html">
            
                    
                    第四章 密鑰和地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="第五章.html">
            
                <a href="第五章.html">
            
                    
                    第五章 錢包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="第六章.html">
            
                <a href="第六章.html">
            
                    
                    第六章 交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="第七章.html">
            
                <a href="第七章.html">
            
                    
                    第七章 高級交易和腳本
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="第八章.html">
            
                <a href="第八章.html">
            
                    
                    第八章 比特幣網路
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.12" data-path="第九章.html">
            
                <a href="第九章.html">
            
                    
                    第九章 區塊鏈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="第十章.html">
            
                <a href="第十章.html">
            
                    
                    第十章 挖礦和共識
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="第十一章.html">
            
                <a href="第十一章.html">
            
                    
                    第十一章 比特幣安全
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="第十二章.html">
            
                <a href="第十二章.html">
            
                    
                    第十二章 區塊鏈應用
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第九章 區塊鏈</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div class="sect1">
<h2 id="blockchain">&#x5340;&#x584A;&#x93C8;</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="__">&#x7C21;&#x4ECB;</h3>
<div class="paragraph">
<p>&#x5340;&#x584A;&#x93C8;&#x7684;&#x8CC7;&#x6599;&#x7D50;&#x69CB;&#x662F;&#x6709;&#x5E8F;&#x7684;&#xFF0C;&#x5411;&#x524D;&#x93C8;&#x63A5;&#x7684;&#x5340;&#x584A;&#x548C;&#x4EA4;&#x6613;&#x7684;&#x5217;&#x8868;&#x3002;&#x5340;&#x584A;&#x93C8;&#x53EF;&#x4EE5;&#x5132;&#x5B58;&#x70BA;&#x4E00;&#x500B;&#x6241;&#x5E73;&#x7684;&#x6A94;&#x6848;&#xFF0C;&#x6216;&#x8005;&#x7C21;&#x55AE;&#x7684;&#x8CC7;&#x6599;&#x5EAB;&#x3002;Bitcoin Core&#x5BA2;&#x6236;&#x7AEF;&#x4F7F;&#x7528;Google&#x7684;LevelDB&#x8CC7;&#x6599;&#x5EAB;&#x5132;&#x5B58;&#x5340;&#x584A;&#x93C8;&#x7684;&#x5143;&#x6578;&#x64DA;&#x3002;&#x5340;&#x584A;&#x5411;&#x524D;&#x93C8;&#x63A5;&#xFF0C;&#x6BCF;&#x500B;&#x5340;&#x584A;&#x90FD;&#x6307;&#x5411;&#x5B83;&#x7684;&#x524D;&#x4E00;&#x500B;&#x5340;&#x584A;&#x3002;&#x5340;&#x584A;&#x93C8;&#x7D93;&#x5E38;&#x88AB;&#x53EF;&#x8996;&#x5316;&#x70BA;&#x5782;&#x76F4;&#x7684;&#x5806;&#x758A;&#xFF0C;&#x7B2C;&#x4E00;&#x500B;&#x5340;&#x584A;&#x4F5C;&#x70BA;&#x5806;&#x758A;&#x5E95;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x4F9D;&#x6B21;&#x5411;&#x4E0A;&#x5806;&#x758A;&#x3002;&#x5F7C;&#x6B64;&#x5806;&#x758A;&#x7684;&#x5340;&#x584A;&#x5806;&#x758A;&#x5F62;&#x5F0F;&#x5F15;&#x51FA;&#x4E86; &quot;height&quot; &#x7684;&#x8853;&#x8A9E;&#xFF0C;&#x4F86;&#x4EE3;&#x8868;&#x5340;&#x584A;&#x8207;&#x7B2C;&#x4E00;&#x500B;&#x5340;&#x584A;&#x7684;&#x8DDD;&#x96E2;&#xFF0C;&quot;top&quot; &#x548C; &quot;tip&quot; &#x6307;&#x4EE3;&#x6700;&#x65B0;&#x6DFB;&#x52A0;&#x7684;&#x5340;&#x584A;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x5340;&#x584A;&#x93C8;&#x4E2D;&#x7684;&#x6BCF;&#x500B;&#x5340;&#x584A;&#x90FD;&#x7531;&#x4E00;&#x500B;&#x96DC;&#x6E4A;&#x503C;&#x6A19;&#x8B58;&#xFF0C;&#x5728;&#x8A72;&#x5340;&#x584A;&#x982D;&#x4E0A;&#x4F7F;&#x7528;SHA256&#x52A0;&#x5BC6;&#x96DC;&#x6E4A;&#x6F14;&#x7B97;&#x6CD5;&#x751F;&#x6210;&#x3002;&#x6BCF;&#x500B;&#x5340;&#x584A;&#x9084;&#x901A;&#x904E;&#x5340;&#x584A;&#x982D;&#x4E2D;&#x7684; &quot;previous block hash&quot;&#xFF08;&#x4E0A;&#x4E00;&#x500B;&#x5340;&#x584A;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#xFF09;&#x6B04;&#x4F4D;&#x5F15;&#x7528;&#x5148;&#x524D;&#x7684;&#x5340;&#x584A;&#xFF0C;&#x7A31;&#x70BA; <em>parent</em> &#x5340;&#x584A;&#x3002;&#x63DB;&#x53E5;&#x8A71;&#x8AAA;&#xFF0C;&#x6BCF;&#x500B;&#x5340;&#x584A;&#x5728;&#x5176;&#x81EA;&#x5DF1;&#x7684;&#x982D;&#x90E8;&#x4E2D;&#x5305;&#x542B;&#x5176;&#x7236;&#x5340;&#x584A;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#x3002;&#x96DC;&#x6E4A;&#x503C;&#x5E8F;&#x5217;&#x5275;&#x5EFA;&#x4E86;&#x4E00;&#x500B;&#x93C8;&#xFF0C;&#x5C07;&#x6BCF;&#x500B;&#x5340;&#x584A;&#x9023;&#x63A5;&#x5230;&#x5176;&#x7236;&#x9805;&#xFF0C;&#x4E00;&#x76F4;&#x93C8;&#x63A5;&#x5230;&#x6709;&#x7B2C;&#x4E00;&#x500B;&#x5340;&#x584A;&#xFF0C;&#x7A31;&#x70BA; <em>&#x5275;&#x4E16;&#x5340;&#x584A;</em> <em>genesis block</em>&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x5118;&#x7BA1;&#x4E00;&#x500B;&#x5340;&#x584A;&#x53EA;&#x6709;&#x4E00;&#x500B;&#x7236;&#x5340;&#x584A;&#xFF0C;&#x4F46;&#x5B83;&#x53EF;&#x4EE5;&#x66AB;&#x6642;&#x64C1;&#x6709;&#x591A;&#x500B;&#x5B50;&#x5340;&#x584A;&#x3002;&#x6BCF;&#x500B;&#x5B50;&#x5340;&#x584A;&#x90FD;&#x6307;&#x5411;&#x76F8;&#x540C;&#x7684;&#x5340;&#x584A;&#x4F5C;&#x70BA;&#x5B83;&#x5011;&#x7684;&#x7236;&#x5340;&#x584A;&#xFF0C;&#x4E26;&#x5728; &quot;previous block hash&quot; &#x6B04;&#x4F4D;&#x4E2D;&#x5305;&#x542B;&#x76F8;&#x540C;&#x7684;&#xFF08;&#x7236;&#x5340;&#x584A;&#x7684;&#xFF09;&#x96DC;&#x6E4A;&#x3002;&#x5728;&#x5340;&#x584A;&#x93C8;&#x201C;&#x5206;&#x53C9;&#x201D;&#x671F;&#x9593;&#x6703;&#x51FA;&#x73FE;&#x591A;&#x500B;&#x5B50;&#x5340;&#x584A;&#xFF0C;&#x9019;&#x662F;&#x4E00;&#x7A2E;&#x81E8;&#x6642;&#x60C5;&#x6CC1;&#xFF0C;&#x7576;&#x4E0D;&#x540C;&#x7684;&#x7926;&#x5340;&#x5E7E;&#x4E4E;&#x540C;&#x6642;&#x7531;&#x4E0D;&#x540C;&#x7684;&#x7926;&#x5DE5;&#x767C;&#x73FE;&#x6642;&#xFF08;&#x53C3;&#x898B; <a href="#forks">[forks]</a>&#xFF09;&#x3002;&#x6700;&#x7D42;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x500B;&#x5B50;&#x5340;&#x584A;&#x6210;&#x70BA;&#x5340;&#x584A;&#x93C8;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x201C;fork&#x201D;&#x5C31;&#x89E3;&#x6C7A;&#x4E86;&#x3002;&#x4E00;&#x500B;&#x5340;&#x584A;&#x53EF;&#x80FD;&#x6709;&#x591A;&#x500B;&#x5B50;&#x5340;&#x584A;&#xFF0C;&#x4F46;&#x6BCF;&#x500B;&#x5340;&#x584A;&#x53EA;&#x6709;&#x4E00;&#x500B;&#x7236;&#x5340;&#x584A;&#x3002;&#x9019;&#x662F;&#x56E0;&#x70BA;&#x4E00;&#x500B;&#x5340;&#x584A;&#x53EA;&#x6709;&#x4E00;&#x500B;&#x5F15;&#x7528;&#x5176;&#x55AE;&#x89AA;&#x7684; &quot;previous block hash&quot; &#x6B04;&#x4F4D;&#x3002;</p>
</div>
<div class="paragraph">
<p>&quot;previous block hash&quot; &#x6B04;&#x4F4D;&#x5728;&#x5340;&#x584A;&#x7684;&#x982D;&#x90E8;&#xFF0C;&#x4E26;&#x4E14;&#x5F71;&#x97FF;&#x7576;&#x524D;&#x5340;&#x584A;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#x3002;&#x5982;&#x679C;&#x7236;&#x5340;&#x584A;&#x7684;&#x6A19;&#x8B58;&#x6539;&#x8B8A;&#xFF0C;&#x5B50;&#x5340;&#x584A;&#x7684;&#x6A19;&#x8B58;&#x4E5F;&#x6703;&#x6539;&#x8B8A;&#x3002;&#x7576;&#x7236;&#x5340;&#x584A;&#x4EE5;&#x67D0;&#x7A2E;&#x65B9;&#x5F0F;&#x6539;&#x8B8A;&#xFF0C;&#x7236;&#x5340;&#x584A;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#x5C31;&#x6703;&#x6539;&#x8B8A;&#x3002;&#x7236;&#x5340;&#x584A;&#x8B8A;&#x5316;&#x4E86;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#x8981;&#x6C42;&#x5B50;&#x5340;&#x584A;&#x7684; &quot;previous block hash&quot; &#x4E5F;&#x5FC5;&#x9808;&#x6539;&#x8B8A;&#xFF0C;&#x9019;&#x53C8;&#x6703;&#x5F15;&#x8D77;&#x5B6B;&#x5B50;&#x5340;&#x584A;&#x7684;&#x6539;&#x8B8A;&#xFF0C;&#x4EE5;&#x6B64;&#x985E;&#x63A8;&#x3002;&#x9019;&#x7A2E;&#x7D1A;&#x806F;&#x6548;&#x61C9;&#x53EF;&#x4EE5;&#x78BA;&#x4FDD;&#x4E00;&#x65E6;&#x4E00;&#x500B;&#x5340;&#x584A;&#x5728;&#x5176;&#x4E4B;&#x5F8C;&#x6709;&#x8A31;&#x591A;&#x5F8C;&#x4EE3;&#xFF0C;&#x5B83;&#x5C31;&#x4E0D;&#x80FD;&#x5728;&#x4E0D;&#x5F37;&#x5236;&#x91CD;&#x65B0;&#x8A08;&#x7B97;&#x6240;&#x6709;&#x5F8C;&#x7E8C;&#x5340;&#x584A;&#x7684;&#x60C5;&#x6CC1;&#x4E0B;&#x9032;&#x884C;&#x66F4;&#x6539;&#x3002;&#x7531;&#x65BC;&#x91CD;&#x65B0;&#x8A08;&#x7B97;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x8A08;&#x7B97;&#xFF08;&#x8017;&#x8CBB;&#x5927;&#x91CF;&#x7684;&#x80FD;&#x6E90;&#xFF09;&#xFF0C;&#x9577;&#x93C8;&#x5340;&#x584A;&#x7684;&#x5B58;&#x5728;&#x4F7F;&#x5F97;&#x5340;&#x584A;&#x93C8;&#x7684;&#x6B77;&#x53F2;&#x4E0D;&#x53EF;&#x66F4;&#x6539;&#xFF0C;&#x9019;&#x662F;&#x6BD4;&#x7279;&#x5E63;&#x5B89;&#x5168;&#x6027;&#x7684;&#x4E00;&#x500B;&#x95DC;&#x9375;&#x7279;&#x5FB5;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x770B;&#x5F85;&#x5340;&#x584A;&#x93C8;&#x7684;&#x4E00;&#x7A2E;&#x65B9;&#x5F0F;&#x5C31;&#x50CF;&#x5730;&#x8CEA;&#x69CB;&#x9020;&#x4E2D;&#x7684;&#x5C64;&#x6216;&#x51B0;&#x5DDD;&#x5DD6;&#x82AF;&#x6A23;&#x672C;&#x3002;&#x8868;&#x5C64;&#x53EF;&#x80FD;&#x96A8;&#x8457;&#x5B63;&#x7BC0;&#x8B8A;&#x5316;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x6C89;&#x6FB1;&#x4E4B;&#x524D;&#x88AB;&#x5439;&#x8D70;&#x3002;&#x4F46;&#x662F;&#x4E00;&#x65E6;&#x6DF1;&#x5165;&#x5E7E;&#x82F1;&#x5BF8;&#xFF0C;&#x5730;&#x8CEA;&#x5C64;&#x5C31;&#x8B8A;&#x5F97;&#x8D8A;&#x4F86;&#x8D8A;&#x7A69;&#x5B9A;&#x3002;&#x7576;&#x4F60;&#x5411;&#x4E0B;&#x770B;&#x5E7E;&#x767E;&#x82F1;&#x5C3A;&#x6642;&#xFF0C;&#x4F60;&#x6703;&#x770B;&#x5230;&#x5E7E;&#x767E;&#x842C;&#x5E74;&#x4F86;&#x4E00;&#x76F4;&#x6C92;&#x6709;&#x53D7;&#x5230;&#x5E72;&#x64FE;&#x7684;&#x904E;&#x53BB;&#x7684;&#x5FEB;&#x7167;&#x3002;&#x5728;&#x5340;&#x584A;&#x93C8;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x7531;&#x65BC;&#x5206;&#x53C9;&#x5C0E;&#x81F4;&#x93C8;&#x91CD;&#x65B0;&#x8A08;&#x7B97;&#xFF0C;&#x53EF;&#x80FD;&#x6703;&#x4FEE;&#x6539;&#x6700;&#x8FD1;&#x7684;&#x5E7E;&#x500B;&#x5340;&#x584A;&#x3002;&#x524D;&#x516D;&#x500B;&#x5340;&#x584A;&#x5C31;&#x50CF;&#x662F;&#x5E7E;&#x82F1;&#x5BF8;&#x7684;&#x8868;&#x571F;&#x3002;&#x4E00;&#x65E6;&#x4F60;&#x6DF1;&#x5165;&#x5340;&#x584A;&#x93C8;&#x8D85;&#x904E;&#x516D;&#x500B;&#x5340;&#x584A;&#xFF0C;&#x5340;&#x584A;&#x8B8A;&#x5316;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5C31;&#x8D8A;&#x4F86;&#x8D8A;&#x5C0F;&#x3002;&#x5728;100&#x500B;&#x5340;&#x584A;&#x4E4B;&#x524D;&#xFF0C;&#x7A69;&#x5B9A;&#x6027;&#x975E;&#x5E38;&#x9AD8;&#xFF0C;&#x4EE5;&#x81F3;&#x65BC;&#x53EF;&#x4EE5;&#x82B1;&#x8CBB;coinbase&#x4EA4;&#x6613; - &#x5305;&#x542B;&#x65B0;&#x958B;&#x63A1;&#x7684;&#x6BD4;&#x7279;&#x5E63;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x5E7E;&#x5343;&#x500B;&#x5340;&#x584A;&#xFF08;&#x4E00;&#x500B;&#x6708;&#xFF09;&#xFF0C;&#x5C0D;&#x65BC;&#x6240;&#x6709;&#x5BE6;&#x969B;&#x76EE;&#x7684;&#x4F86;&#x8AAA;&#xFF0C;&#x5340;&#x584A;&#x93C8;&#x90FD;&#x5DF2;&#x6210;&#x78BA;&#x5B9A;&#x7684;&#x6B77;&#x53F2;&#x3002;&#x96D6;&#x7136;&#x5354;&#x8B70;&#x7E3D;&#x662F;&#x5141;&#x8A31;&#x4E00;&#x689D;&#x93C8;&#x88AB;&#x4E00;&#x689D;&#x8F03;&#x9577;&#x7684;&#x93C8;&#x6D88;&#x9664;&#xFF0C;&#x4EFB;&#x4F55;&#x5340;&#x584A;&#x88AB;&#x53CD;&#x8F49;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x7E3D;&#x662F;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x9019;&#x7A2E;&#x4E8B;&#x4EF6;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x6703;&#x96A8;&#x8457;&#x6642;&#x9593;&#x6D41;&#x901D;&#x800C;&#x6E1B;&#x5C11;&#xFF0C;&#x76F4;&#x5230;&#x5B83;&#x8B8A;&#x5F97;&#x7121;&#x9650;&#x5C0F;&#x3002;</p>
</div>
</div>
<div class="sect2">
<h3 id="___2">&#x5340;&#x584A;&#x7684;&#x7D50;&#x69CB;</h3>
<div class="paragraph">
<p>&#x5340;&#x584A;&#x662F;&#x4E00;&#x500B;&#x5BB9;&#x5668;&#x8CC7;&#x6599;&#x7D50;&#x69CB;&#xFF0C;&#x7528;&#x65BC;&#x5F59;&#x7E3D;&#x5305;&#x542B;&#x5728;&#x516C;&#x5171;&#x8CEC;&#x672C;&#xFF08;&#x5340;&#x584A;&#x93C8;&#xFF09;&#x4E2D;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x5340;&#x584A;&#x6709;&#x4E00;&#x500B;&#x5305;&#x542B;&#x5143;&#x6578;&#x64DA;&#x7684;&#x982D;&#x90E8;&#xFF0C;&#x5F8C;&#x9762;&#x8DDF;&#x8457;&#x4E00;&#x500B;&#x9577;&#x9577;&#x7684;&#x4EA4;&#x6613;&#x5217;&#x8868;&#x3002;&#x5340;&#x584A;&#x982D;&#x70BA;80&#x5B57;&#x7BC0;&#xFF0C;&#x5E73;&#x5747;&#x4EA4;&#x6613;&#x81F3;&#x5C11;&#x70BA;400&#x5B57;&#x7BC0;&#xFF0C;&#x5E73;&#x5747;&#x6BCF;&#x5340;&#x584A;&#x5305;&#x542B;&#x8D85;&#x904E;1900&#x500B;&#x4EA4;&#x6613;&#x3002;&#x4E00;&#x500B;&#x5305;&#x542B;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x7684;&#x5B8C;&#x6574;&#x5340;&#x584A;&#x56E0;&#x6B64;&#x6BD4;&#x5340;&#x584A;&#x982D;&#x5927;10,000&#x500D;&#x3002; <a href="#block_structure1">The structure of a block</a> &#x63CF;&#x8FF0;&#x4E86;&#x4E00;&#x500B;&#x5340;&#x584A;&#x7684;&#x7D50;&#x69CB;&#x3002;</p>
</div>
<table id="block_structure1" class="tableblock frame-all grid-all spread pagebreak-before">
<caption class="title">Table 1. The structure of a block</caption>
<colgroup>
<col style="width: 33.3333%;">
<col style="width: 33.3333%;">
<col style="width: 33.3334%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">Size</th>
<th class="tableblock halign-left valign-top">Field</th>
<th class="tableblock halign-left valign-top">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">4 bytes</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Block Size</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">The size of the block, in bytes, following this field</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">80 bytes</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Block Header</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Several fields form the block header</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">1&#x2014;&#x2014;9 bytes (VarInt)</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Transaction Counter</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">How many transactions follow</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">Variable</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Transactions</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">The transactions recorded in this block</p></td>
</tr>
</tbody>
</table>
</div>
<div class="sect2">
<h3 id="block_header">&#x5340;&#x584A;&#x982D;</h3>
<div class="paragraph">
<p>&#x5340;&#x584A;&#x982D;&#x7531;&#x4E09;&#x7D44;&#x5340;&#x584A;&#x5143;&#x6578;&#x64DA;&#x7D44;&#x6210;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6709;&#x4E00;&#x500B;&#x5C0D;&#x524D;&#x5340;&#x584A;&#x96DC;&#x6E4A;&#x503C;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x5B83;&#x5C07;&#x9019;&#x500B;&#x5340;&#x584A;&#x9023;&#x63A5;&#x5230;&#x5340;&#x584A;&#x93C8;&#x4E2D;&#x7684;&#x524D;&#x4E00;&#x500B;&#x5340;&#x584A;&#x3002;&#x7B2C;&#x4E8C;&#x7D44;&#x5143;&#x6578;&#x64DA;&#xFF0C;&#x5206;&#x5225;&#x70BA; <em>&#x96E3;&#x5EA6;</em> <em>difficulty</em>&#xFF0C;<em>&#x6642;&#x9593;&#x6233;</em> <em>timestamp</em> &#x548C; <em>&#x96A8;&#x6A5F;&#x6578;</em> <em>nonce</em>&#xFF0C;&#x8207;&#x6316;&#x7926;&#x7AF6;&#x8CFD;&#x6709;&#x95DC;&#xFF0C;&#x53C3;&#x898B; <a href="#mining">[mining]</a>&#x3002;&#x7B2C;&#x4E09;&#x500B;&#x5143;&#x6578;&#x64DA;&#x662F;merkle&#x6A39;&#x6839;&#xFF0C;&#x9019;&#x662F;&#x4E00;&#x7A2E;&#x8CC7;&#x6599;&#x7D50;&#x69CB;&#xFF0C;&#x7528;&#x65BC;&#x6709;&#x6548;&#x5730;&#x5F59;&#x7E3D;&#x5340;&#x584A;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x3002;<a href="#block_header_structure_ch09">The structure of the block header</a> &#x63CF;&#x8FF0;&#x4E86;&#x5340;&#x584A;&#x982D;&#x7684;&#x7D50;&#x69CB;&#x3002;</p>
</div>
<table id="block_header_structure_ch09" class="tableblock frame-all grid-all spread">
<caption class="title">Table 2. The structure of the block header</caption>
<colgroup>
<col style="width: 33.3333%;">
<col style="width: 33.3333%;">
<col style="width: 33.3334%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">Size</th>
<th class="tableblock halign-left valign-top">Field</th>
<th class="tableblock halign-left valign-top">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">4 bytes</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Version</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">A version number to track software/protocol upgrades</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">32 bytes</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Previous Block Hash</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">A reference to the hash of the previous (parent) block in the chain</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">32 bytes</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Merkle Root</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">A hash of the root of the merkle tree of this block&#x2019;s transactions</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">4 bytes</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Timestamp</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">The approximate creation time of this block (seconds from Unix Epoch)</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">4 bytes</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Difficulty Target</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">The Proof-of-Work algorithm difficulty target for this block</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">4 bytes</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">Nonce</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">A counter used for the Proof-of-Work algorithm</p></td>
</tr>
</tbody>
</table>
<div class="paragraph">
<p>&#x96A8;&#x6A5F;&#x6578;&#xFF0C;&#x96E3;&#x5EA6;&#x76EE;&#x6A19;&#xFF0C;&#x548C;&#x6642;&#x9593;&#x6233;&#x7528;&#x65BC;&#x6316;&#x7926;&#x904E;&#x7A0B;&#xFF0C;&#x5728; <a href="#mining">[mining]</a> &#x4E2D;&#x6709;&#x8A73;&#x7D30;&#x4ECB;&#x7D39;&#x3002;</p>
</div>
</div>
<div class="sect2">
<h3 id="block_hash">&#x5340;&#x584A;&#x6A19;&#x8B58;&#x7B26;&#xFF1A;&#x5340;&#x584A;&#x982D;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#x548C;&#x5340;&#x584A;&#x9AD8;&#x5EA6;</h3>
<div class="paragraph">
<p>&#x5340;&#x584A;&#x7684;&#x4E3B;&#x8981;&#x6A19;&#x8B58;&#x7B26;&#x662F;&#x5B83;&#x7684;&#x52A0;&#x5BC6;&#x96DC;&#x6E4A;&#x503C;&#xFF0C;&#x9019;&#x662F;&#x4E00;&#x7A2E;&#x6578;&#x5B57;&#x6307;&#x7D0B;&#xFF0C;&#x901A;&#x904E;SHA256&#x6F14;&#x7B97;&#x6CD5;&#x5C07;&#x5340;&#x584A;&#x982D;&#x5169;&#x6B21;&#x96DC;&#x6E4A;&#x7372;&#x5F97;&#x3002;&#x5F97;&#x5230;&#x7684;32&#x5B57;&#x7BC0;&#x96DC;&#x6E4A;&#x88AB;&#x7A31;&#x70BA; <em>block hash</em> &#xFF0C;&#x66F4;&#x6E96;&#x78BA;&#x5730;&#x8AAA;&#x662F; <em>block header hash</em>&#xFF0C;&#x56E0;&#x70BA;&#x53EA;&#x6709;&#x5340;&#x584A;&#x982D;&#x7528;&#x65BC;&#x8A08;&#x7B97;&#x3002;&#x4F8B;&#x5982; 000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f &#x662F;&#x7B2C;&#x4E00;&#x500B;&#x5340;&#x584A;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#xFF0C;
&#x5340;&#x584A;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#x552F;&#x4E00;&#x800C;&#x660E;&#x78BA;&#x5730;&#x6A19;&#x8B58;&#x4E00;&#x500B;&#x5340;&#x584A;&#xFF0C;&#x4EFB;&#x4F55;&#x7BC0;&#x9EDE;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x904E;&#x7C21;&#x55AE;&#x5730;&#x5C0D;&#x5340;&#x584A;&#x982D;&#x9032;&#x884C;&#x96DC;&#x6E4A;&#x4F86;&#x7368;&#x7ACB;&#x5730;&#x6D3E;&#x751F;&#x5B83;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x6CE8;&#x610F;&#xFF0C;&#x5340;&#x584A;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#x5BE6;&#x969B;&#x4E0A;&#x4E26;&#x4E0D;&#x5305;&#x542B;&#x5728;&#x5340;&#x584A;&#x7684;&#x8CC7;&#x6599;&#x7D50;&#x69CB;&#x4E2D;&#xFF0C;&#x7121;&#x8AD6;&#x662F;&#x5728;&#x7DB2;&#x8DEF;&#x4E0A;&#x50B3;&#x8F38;&#x5340;&#x584A;&#x6642;&#xFF0C;&#x9084;&#x662F;&#x4F5C;&#x70BA;&#x5340;&#x584A;&#x93C8;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x5132;&#x5B58;&#x5728;&#x7BC0;&#x9EDE;&#x7684;&#x6301;&#x4E45;&#x6027;&#x5132;&#x5B58;&#x6642;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x7576;&#x5F9E;&#x7DB2;&#x8DEF;&#x63A5;&#x6536;&#x5340;&#x584A;&#x6642;&#xFF0C;&#x6BCF;&#x500B;&#x7BC0;&#x9EDE;&#x8A08;&#x7B97;&#x5340;&#x584A;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#x3002;&#x5340;&#x584A;&#x96DC;&#x6E4A;&#x503C;&#x53EF;&#x4EE5;&#x4F5C;&#x70BA;&#x5340;&#x584A;&#x5143;&#x6578;&#x64DA;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x5132;&#x5B58;&#x5728;&#x55AE;&#x7368;&#x7684;&#x8CC7;&#x6599;&#x5EAB;&#x8868;&#x4E2D;&#xFF0C;&#x4EE5;&#x65B9;&#x4FBF;&#x7D22;&#x5F15;&#x4E26;&#x5F9E;&#x786C;&#x789F;&#x5FEB;&#x901F;&#x6AA2;&#x7D22;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x53E6;&#x4E00;&#x7A2E;&#x8B58;&#x5225;&#x5340;&#x584A;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5B83;&#x5728;&#x5340;&#x584A;&#x93C8;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x7A31;&#x70BA; <em>&#x5340;&#x584A;&#x9AD8;&#x5EA6;</em> <em>block height</em>&#x3002;&#x7B2C;&#x4E00;&#x500B;&#x5340;&#x584A;&#x4F4D;&#x65BC;&#x5340;&#x584A;&#x9AD8;&#x5EA6;0&#x8655;&#xFF0C;&#x8207;&#x88AB;&#x96DC;&#x6E4A;&#x503C; 000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f &#x5F15;&#x7528;&#x7684;&#x5340;&#x584A;&#x76F8;&#x540C;&#x3002;&#x5340;&#x584A;&#x53EF;&#x4EE5;&#x901A;&#x904E;&#x5169;&#x7A2E;&#x65B9;&#x5F0F;&#x6A19;&#x8B58;&#xFF1A;&#x901A;&#x904E;&#x5F15;&#x7528;&#x5340;&#x584A;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#x6216;&#x901A;&#x904E;&#x5F15;&#x7528;&#x5340;&#x584A;&#x9AD8;&#x5EA6;&#x3002;&#x5728;&#x7B2C;&#x4E00;&#x500B;&#x5340;&#x584A;&#x7684;&#x201C;&#x9802;&#x90E8;&#x201D;&#x6DFB;&#x52A0;&#x7684;&#x6BCF;&#x500B;&#x5F8C;&#x7E8C;&#x5340;&#x584A;&#x5728;&#x5340;&#x584A;&#x93C8;&#x4E2D;&#x90FD;&#x5728;&#x4E00;&#x500B;&#x201C;&#x66F4;&#x9AD8;&#x201D;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5C31;&#x50CF;&#x4E00;&#x500B;&#x76D2;&#x5B50;&#x758A;&#x5728;&#x53E6;&#x4E00;&#x500B;&#x4E0A;&#x9762;&#x4E00;&#x6A23;&#x3002;2017&#x5E74;1&#x6708;1&#x65E5;&#x7684;&#x5340;&#x584A;&#x93C8;&#x9AD8;&#x5EA6;&#x7D04;&#x70BA;44.6&#x842C;&#xFF0C;&#x9019;&#x610F;&#x5473;&#x8457;&#x5728;2009&#x5E74;1&#x6708;&#x5275;&#x5EFA;&#x7684;&#x7B2C;&#x4E00;&#x500B;&#x5340;&#x584A;&#x7684;&#x9802;&#x90E8;&#x6709;446000&#x500B;&#x5340;&#x584A;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x8207;&#x5340;&#x584A;&#x96DC;&#x6E4A;&#x503C;&#x4E0D;&#x540C;&#xFF0C;&#x5340;&#x584A;&#x9AD8;&#x5EA6;&#x4E0D;&#x662F;&#x552F;&#x4E00;&#x6A19;&#x8B58;&#x7B26;&#x3002;&#x5118;&#x7BA1;&#x55AE;&#x500B;&#x5340;&#x584A;&#x7E3D;&#x662F;&#x5177;&#x6709;&#x7279;&#x5B9A;&#x4E14;&#x4E0D;&#x8B8A;&#x7684;&#x5340;&#x584A;&#x9AD8;&#x5EA6;&#xFF0C;&#x4F46;&#x53CD;&#x904E;&#x4F86;&#x4E26;&#x4E0D;&#x6B63;&#x78BA; &#x2014;&#x2014; &#x5340;&#x584A;&#x9AD8;&#x5EA6;&#x4E26;&#x4E0D;&#x7E3D;&#x662F;&#x6A19;&#x8B58;&#x4E00;&#x500B;&#x5340;&#x584A;&#x3002;&#x5169;&#x500B;&#x6216;&#x66F4;&#x591A;&#x5340;&#x584A;&#x53EF;&#x80FD;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x5340;&#x584A;&#x9AD8;&#x5EA6;&#xFF0C;&#x722D;&#x596A;&#x5340;&#x584A;&#x93C8;&#x4E2D;&#x7684;&#x76F8;&#x540C;&#x4F4D;&#x7F6E;&#x3002;&#x9019;&#x7A2E;&#x60C5;&#x6CC1;&#x5C07;&#x5728; <a href="#forks">[forks]</a> &#x4E00;&#x7BC0;&#x4E2D;&#x8A73;&#x7D30;&#x8A0E;&#x8AD6;&#x3002;&#x5340;&#x584A;&#x9AD8;&#x5EA6;&#x4E5F;&#x4E0D;&#x662F;&#x5340;&#x584A;&#x7684;&#x8CC7;&#x6599;&#x7D50;&#x69CB;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF1B;&#x5B83;&#x4E0D;&#x5132;&#x5B58;&#x5728;&#x5340;&#x584A;&#x4E2D;&#x3002;&#x7576;&#x5F9E;&#x6BD4;&#x7279;&#x5E63;&#x7DB2;&#x8DEF;&#x6536;&#x5230;&#x5340;&#x584A;&#x6642;&#xFF0C;&#x6BCF;&#x500B;&#x7BC0;&#x9EDE;&#x90FD;&#x6703;&#x52D5;&#x614B;&#x8B58;&#x5225;&#x5340;&#x584A;&#x5728;&#x5340;&#x584A;&#x93C8;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#xFF08;&#x9AD8;&#x5EA6;&#xFF09;&#x3002;&#x5340;&#x584A;&#x9AD8;&#x5EA6;&#x4E5F;&#x53EF;&#x4EE5;&#x4F5C;&#x70BA;&#x5143;&#x6578;&#x64DA;&#x5132;&#x5B58;&#x5728;&#x7D22;&#x5F15;&#x8CC7;&#x6599;&#x5EAB;&#x8868;&#x4E2D;&#x4EE5;&#x52A0;&#x5FEB;&#x6AA2;&#x7D22;&#x901F;&#x5EA6;&#x3002;</p>
</div>
<div class="admonitionblock tip">
<table>
<tr>
<td class="icon">
<div class="title">Tip</div>
</td>
<td class="content">
<div class="paragraph">
<p>&#x5340;&#x584A;&#x7684;<em>block hash</em>&#x7E3D;&#x662F;&#x552F;&#x4E00;&#x6A19;&#x8B58;&#x4E00;&#x500B;&#x5340;&#x584A;&#x3002;&#x5340;&#x584A;&#x4E5F;&#x7E3D;&#x662F;&#x6709;&#x4E00;&#x500B;&#x7279;&#x5B9A;&#x7684;<em>block height</em>&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7279;&#x5B9A;&#x7684;&#x5340;&#x584A;&#x9AD8;&#x5EA6;&#x4E26;&#x4E0D;&#x7E3D;&#x662F;&#x80FD;&#x5920;&#x6A19;&#x8B58;&#x55AE;&#x500B;&#x5340;&#x584A;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5169;&#x5340;&#x584A;&#x6216;&#x66F4;&#x591A;&#x5340;&#x584A;&#x53EF;&#x80FD;&#x6703;&#x5728;&#x5340;&#x584A;&#x93C8;&#x4E2D;&#x722D;&#x596A;&#x4E00;&#x500B;&#x4F4D;&#x7F6E;&#x3002;</p>
</div>
</td>
</tr>
</table>
</div>
</div>
<div class="sect2">
<h3 id="___3">&#x5275;&#x4E16;&#x5340;&#x584A;</h3>
<div class="paragraph">
<p>&#x5340;&#x584A;&#x93C8;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x500B;&#x5340;&#x584A;&#x88AB;&#x7A31;&#x70BA;&#x5275;&#x4E16;&#x5340;&#x584A;&#xFF0C;&#x65BC;2009&#x5E74;&#x5275;&#x5EFA;&#x3002;&#x5B83;&#x662F;&#x5340;&#x584A;&#x93C8;&#x4E2D;&#x6240;&#x6709;&#x5340;&#x584A;&#x7684;&#x5171;&#x540C;&#x7956;&#x5148;&#xFF0C;&#x9019;&#x610F;&#x5473;&#x8457;&#x5982;&#x679C;&#x4F60;&#x5F9E;&#x4EFB;&#x4F55;&#x5340;&#x584A;&#x958B;&#x59CB;&#xFF0C;&#x4E26;&#x96A8;&#x6642;&#x9593;&#x4E0A;&#x5411;&#x524D;&#x8FFD;&#x6EAF;&#xFF0C;&#x6700;&#x7D42;&#x5C07;&#x5230;&#x9054;&#x5275;&#x4E16;&#x5340;&#x584A;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x7BC0;&#x9EDE;&#x7E3D;&#x662F;&#x4EE5;&#x81F3;&#x5C11;&#x4E00;&#x500B;&#x5340;&#x584A;&#x7684;&#x5340;&#x584A;&#x93C8;&#x958B;&#x59CB;&#xFF0C;&#x56E0;&#x70BA;&#x9019;&#x500B;&#x5340;&#x584A;&#x662F;&#x5728;&#x6BD4;&#x7279;&#x5E63;&#x5BA2;&#x6236;&#x7AEF;&#x8EDF;&#x9AD4;&#x4E2D;&#x975C;&#x614B;&#x7DE8;&#x78BC;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4E0D;&#x80FD;&#x88AB;&#x6539;&#x8B8A;&#x3002;&#x6BCF;&#x500B;&#x7BC0;&#x9EDE;&#x7E3D;&#x662F;&#x201C;&#x77E5;&#x9053;&#x201D;&#x8D77;&#x59CB;&#x5340;&#x584A;&#x7684;&#x96DC;&#x6E4A;&#x548C;&#x7D50;&#x69CB;&#xFF0C;&#x5B83;&#x5275;&#x5EFA;&#x7684;&#x56FA;&#x5B9A;&#x6642;&#x9593;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x4E2D;&#x7684;&#x55AE;&#x4E00;&#x4EA4;&#x6613;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6BCF;&#x500B;&#x7BC0;&#x9EDE;&#x90FD;&#x6709;&#x5340;&#x584A;&#x93C8;&#x7684;&#x8D77;&#x9EDE;&#xFF0C;&#x9019;&#x662F;&#x4E00;&#x500B;&#x5B89;&#x5168;&#x7684;&#x201C;&#x6839;&#x201D;&#xFF0C;&#x5F9E;&#x4E2D;&#x53EF;&#x4EE5;&#x69CB;&#x5EFA;&#x53D7;&#x4FE1;&#x4EFB;&#x7684;&#x5340;&#x584A;&#x93C8;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x8ACB;&#x53C3;&#x95B1; <a href="http://bit.ly/1x6rcwP" target="_blank"><em>chainparams.cpp</em></a> &#x4E2D; Bitcoin Core &#x5BA2;&#x6236;&#x7AEF;&#x5167;&#x7684;&#x975C;&#x614B;&#x7DE8;&#x78BC;&#x7684;genesis&#x5340;&#x584A;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x4EE5;&#x4E0B;&#x96DC;&#x6E4A;&#x503C;&#x6A19;&#x8B58;&#x7B26;&#x5C6C;&#x65BC;&#x5275;&#x4E16;&#x5340;&#x584A;&#xFF1A;</p>
</div>
<div class="listingblock">
<div class="content">
<pre>000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f</pre>
</div>
</div>
<div class="paragraph">
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x5340;&#x584A;&#x700F;&#x89BD;&#x5668;&#x7DB2;&#x7AD9;&#xFF08;&#x4F8B;&#x5982; <em>blockchain.info</em> &#xFF09;&#x4E2D;&#x641C;&#x7D22;&#x8A72;&#x5340;&#x584A;&#x96DC;&#x6E4A;&#x503C;&#xFF0C;&#x4F60;&#x5C07;&#x627E;&#x5230;&#x4E00;&#x500B;&#x63CF;&#x8FF0;&#x6B64;&#x5340;&#x584A;&#x5167;&#x5BB9;&#x7684;&#x9801;&#x9762;&#xFF0C;&#x5305;&#x542B;&#x8A72;&#x96DC;&#x6E4A;&#x7684;URL&#xFF1A;</p>
</div>
<div class="paragraph">
<p><a href="https://blockchain.info/block/000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f" class="bare" target="_blank">https://blockchain.info/block/000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f</a></p>
</div>
<div class="paragraph">
<p>&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E2D;&#x4F7F;&#x7528; Bitcoin Core &#x5BA2;&#x6236;&#x7AEF;&#xFF1A;</p>
</div>
<div class="listingblock">
<div class="content">
<pre>$ bitcoin-cli getblock 000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f</pre>
</div>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-json" data-lang="json">{
    <span class="hljs-string">&quot;hash&quot;</span> : <span class="hljs-string">&quot;000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f&quot;</span>,
    <span class="hljs-string">&quot;confirmations&quot;</span> : <span class="hljs-number">308321</span>,
    <span class="hljs-string">&quot;size&quot;</span> : <span class="hljs-number">285</span>,
    <span class="hljs-string">&quot;height&quot;</span> : <span class="hljs-number">0</span>,
    <span class="hljs-string">&quot;version&quot;</span> : <span class="hljs-number">1</span>,
    <span class="hljs-string">&quot;merkleroot&quot;</span> : <span class="hljs-string">&quot;4a5e1e4baab89f3a32518a88c31bc87f618f76673e2cc77ab2127b7afdeda33b&quot;</span>,
    <span class="hljs-string">&quot;tx&quot;</span> : [
        <span class="hljs-string">&quot;4a5e1e4baab89f3a32518a88c31bc87f618f76673e2cc77ab2127b7afdeda33b&quot;</span>
    ],
    <span class="hljs-string">&quot;time&quot;</span> : <span class="hljs-number">1231006505</span>,
    <span class="hljs-string">&quot;nonce&quot;</span> : <span class="hljs-number">2083236893</span>,
    <span class="hljs-string">&quot;bits&quot;</span> : <span class="hljs-string">&quot;1d00ffff&quot;</span>,
    <span class="hljs-string">&quot;difficulty&quot;</span> : <span class="hljs-number">1.00000000</span>,
    <span class="hljs-string">&quot;nextblockhash&quot;</span> : <span class="hljs-string">&quot;00000000839a8e6886ab5951d76f411475428afc90947ee320161bbf18eb6048&quot;</span>
}</code></pre>
</div>
</div>
<div class="paragraph">
<p>&#x5275;&#x4E16;&#x5340;&#x584A;&#x5305;&#x542B;&#x4E00;&#x500B;&#x96B1;&#x85CF;&#x7684;&#x8A0A;&#x606F;&#x3002;&#x5E63;&#x57FA;&#x4EA4;&#x6613;&#x7684;&#x8F38;&#x5165;&#x5305;&#x542B;&#x7684;&#x6587;&#x5B57;&#x662F; &quot;The Times 03/Jan/2009 Chancellor on brink of second bailout for banks.&quot;&#x3002;&#x6B64;&#x8A0A;&#x606F;&#x65E8;&#x5728;&#x901A;&#x904E;&#x53C3;&#x8003;&#x82F1;&#x570B;&#x5831;&#x7D19; <em>The_Times</em> &#x7684;&#x6A19;&#x984C;&#x63D0;&#x4F9B;&#x6B64;&#x5340;&#x584A;&#x5275;&#x5EFA;&#x7684;&#x6700;&#x65E9;&#x65E5;&#x671F;&#x7684;&#x8B49;&#x64DA;&#x3002;&#x5B83;&#x9084;&#x534A;&#x958B;&#x73A9;&#x7B11;&#x5730;&#x63D0;&#x9192;&#x4EBA;&#x5011;&#x95DC;&#x6CE8;&#x7368;&#x7ACB;&#x8CA8;&#x5E63;&#x9AD4;&#x7CFB;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x6BD4;&#x7279;&#x5E63;&#x767C;&#x884C;&#x6642;&#x6B63;&#x503C;&#x524D;&#x6240;&#x672A;&#x6709;&#x7684;&#x5168;&#x7403;&#x8CA8;&#x5E63;&#x5371;&#x6A5F;&#x3002;&#x6BD4;&#x7279;&#x5E63;&#x7684;&#x5275;&#x9020;&#x8005;Satoshi Nakamoto&#x5C07;&#x9019;&#x500B;&#x8A0A;&#x606F;&#x5D4C;&#x5165;&#x4E86;&#x7B2C;&#x4E00;&#x5340;&#x584A;&#x3002;</p>
</div>
</div>
<div class="sect2">
<h3 id="___4">&#x5728;&#x5340;&#x584A;&#x93C8;&#x4E2D;&#x93C8;&#x63A5;&#x5340;&#x584A;</h3>
<div class="paragraph">
<p>&#x6BD4;&#x7279;&#x5E63;&#x5B8C;&#x6574;&#x7BC0;&#x9EDE;&#x4FDD;&#x7559;&#x4E86;&#x5340;&#x584A;&#x93C8;&#x5F9E;&#x5275;&#x4E16;&#x5340;&#x584A;&#x958B;&#x59CB;&#x7684;&#x672C;&#x5730;&#x526F;&#x672C;&#x3002;&#x5340;&#x584A;&#x93C8;&#x7684;&#x672C;&#x5730;&#x526F;&#x672C;&#x6703;&#x96A8;&#x8457;&#x65B0;&#x5340;&#x584A;&#x88AB;&#x767C;&#x73FE;&#x4E26;&#x7528;&#x65BC;&#x64F4;&#x5C55;&#x93C8;&#x800C;&#x4E0D;&#x65B7;&#x66F4;&#x65B0;&#x3002;&#x7576;&#x4E00;&#x500B;&#x7BC0;&#x9EDE;&#x901A;&#x904E;&#x7DB2;&#x8DEF;&#x63A5;&#x6536;&#x5230;&#x5340;&#x584A;&#x6642;&#xFF0C;&#x5B83;&#x9A57;&#x8B49;&#x9019;&#x4E9B;&#x5340;&#x584A;&#xFF0C;&#x7136;&#x5F8C;&#x5C07;&#x5B83;&#x5011;&#x93C8;&#x63A5;&#x5230;&#x73FE;&#x6709;&#x7684;&#x5340;&#x584A;&#x93C8;&#x3002;&#x70BA;&#x4E86;&#x5EFA;&#x7ACB;&#x93C8;&#x63A5;&#xFF0C;&#x7BC0;&#x9EDE;&#x5C07;&#x6AA2;&#x67E5;&#x50B3;&#x5165;&#x7684;&#x5340;&#x584A;&#x982D;&#x4E26;&#x67E5;&#x627E;&#x201C;previous block hash&#x201D;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8A2D;&#x4E00;&#x500B;&#x7BC0;&#x9EDE;&#x5728;&#x5340;&#x584A;&#x93C8;&#x7684;&#x672C;&#x5730;&#x526F;&#x672C;&#x4E2D;&#x6709;277,314&#x500B;&#x5340;&#x584A;&#x3002;&#x7BC0;&#x9EDE;&#x77E5;&#x9053;&#x7684;&#x6700;&#x5F8C;&#x4E00;&#x500B;&#x5340;&#x584A;&#x662F;&#x5340;&#x584A;277,314&#xFF0C;&#x5340;&#x584A;&#x982D;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#x70BA;&#xFF1A;</p>
</div>
<div class="listingblock">
<div class="content">
<pre>00000000000000027e7ba6fe7bad39faf3b5a83daed765f05f7d1b71a1632249</pre>
</div>
</div>
<div class="paragraph">
<p>&#x7136;&#x5F8C;&#xFF0C;&#x8A72;&#x7BC0;&#x9EDE;&#x5F9E;&#x7DB2;&#x8DEF;&#x63A5;&#x6536;&#x4E00;&#x500B;&#x65B0;&#x7684;&#x5340;&#x584A;&#xFF0C;&#x89E3;&#x6790;&#x5982;&#x4E0B;&#xFF1A;</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-json" data-lang="json">{
    &quot;size&quot; : 43560,
    &quot;version&quot; : 2,
    &quot;previousblockhash&quot; :
        &quot;00000000000000027e7ba6fe7bad39faf3b5a83daed765f05f7d1b71a1632249&quot;,
    &quot;merkleroot&quot; :
        &quot;5e049f4030e0ab2debb92378f53c0a6e09548aea083f3ab25e1d94ea1155e29d&quot;,
    &quot;time&quot; : 1388185038,
    &quot;difficulty&quot; : 1180923195.25802612,
    &quot;nonce&quot; : 4215469401,
    &quot;tx&quot; : [
        &quot;257e7497fb8bc68421eb2c7b699dbab234831600e7352f0d9e6522c7cf3f6c77&quot;,

 #[... many more transactions omitted ...]

        &quot;05cfd38f6ae6aa83674cc99e4d75a1458c165b7ab84725eda41d018a09176634&quot;
    ]
}</code></pre>
</div>
</div>
<div class="paragraph">
<p>&#x67E5;&#x770B;&#x9019;&#x500B;&#x65B0;&#x5340;&#x584A;&#xFF0C;&#x627E;&#x5230; previousblockhash &#x6B04;&#x4F4D;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x5176;&#x7236;&#x5340;&#x584A;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#x3002;&#x5B83;&#x662F;&#x7BC0;&#x9EDE;&#x6240;&#x77E5;&#x9053;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#xFF0C;&#x662F;&#x4F4D;&#x65BC;&#x93C8;&#x7684;277,314&#x9AD8;&#x5EA6;&#x7684;&#x6700;&#x5F8C;&#x4E00;&#x500B;&#x5340;&#x584A;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x9019;&#x500B;&#x65B0;&#x5340;&#x584A;&#x662F;&#x93C8;&#x4E0A;&#x6700;&#x5F8C;&#x4E00;&#x500B;&#x5340;&#x584A;&#x7684;&#x5B69;&#x5B50;&#xFF0C;&#x4E26;&#x64F4;&#x5C55;&#x4E86;&#x73FE;&#x6709;&#x7684;&#x5340;&#x584A;&#x93C8;&#x3002;&#x8A72;&#x7BC0;&#x9EDE;&#x5C07;&#x6B64;&#x65B0;&#x5340;&#x584A;&#x6DFB;&#x52A0;&#x5230;&#x93C8;&#x7684;&#x672B;&#x7AEF;&#xFF0C;&#x4F7F;&#x5340;&#x584A;&#x93C8;&#x66F4;&#x9577;&#xFF0C;&#x65B0;&#x7684;&#x9AD8;&#x5EA6;&#x70BA;277,315&#x3002;<a href="#chain_of_blocks">Blocks linked in a chain by reference to the previous block header hash</a> &#x986F;&#x793A;&#x4E09;&#x500B;&#x5340;&#x584A;&#x7684;&#x93C8;&#xFF0C;&#x901A;&#x904E; previousblockhash &#x6B04;&#x4F4D;&#x4E2D;&#x7684;&#x5F15;&#x7528;&#x93C8;&#x63A5;&#x3002;</p>
</div>
</div>
<div class="sect2">
<h3 id="merkle_trees">&#x9ED8;&#x514B;&#x723E;&#x6A39; Merkle Trees</h3>
<div class="paragraph">
<p>&#x6BD4;&#x7279;&#x5E63;&#x5340;&#x584A;&#x93C8;&#x4E2D;&#x7684;&#x6BCF;&#x500B;&#x5340;&#x584A;&#x90FD;&#x5305;&#x542B;&#x4E00;&#x500B; <em>merkle tree</em> &#xFF0C;&#x4F5C;&#x70BA;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x7684;&#x5F59;&#x7E3D;&#x3002;</p>
</div>
<div class="paragraph">
<p><em>&#x9ED8;&#x514B;&#x723E;&#x6A39;</em> <em>merkle tree</em>, &#x4E5F;&#x53EB;&#x505A; <em>&#x4E8C;&#x5143;&#x96DC;&#x6E4A;&#x6A39;</em> <em>binary hash tree</em>, &#x662F;&#x4E00;&#x7A2E;&#x7528;&#x65BC;&#x6709;&#x6548;&#x5F59;&#x7E3D;&#x548C;&#x9A57;&#x8B49;&#x5927;&#x578B;&#x6578;&#x64DA;&#x96C6;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x7684;&#x8CC7;&#x6599;&#x7D50;&#x69CB;&#x3002; Merkle&#x6A39;&#x662F;&#x5305;&#x542B;&#x52A0;&#x5BC6;&#x96DC;&#x6E4A;&#x7684;&#x4E8C;&#x5143;&#x6A39;&#x3002;&#x8853;&#x8A9E;&#x201C;&#x6A39;&#x201D;&#x5728;&#x96FB;&#x8166;&#x79D1;&#x5B78;&#x4E2D;&#x88AB;&#x7528;&#x4F86;&#x63CF;&#x8FF0;&#x5206;&#x652F;&#x7684;&#x8CC7;&#x6599;&#x7D50;&#x69CB;&#xFF0C;&#x4F46;&#x662F;&#x9019;&#x4E9B;&#x6A39;&#x901A;&#x5E38;&#x662F;&#x985B;&#x5012;&#x986F;&#x793A;&#x7684;&#xFF0C;&#x201C;&#x6839;&#x201D;&#x5728;&#x9802;&#x90E8;&#xFF0C;&#x201C;&#x8449;&#x5B50;&#x201D;&#x5728;&#x5E95;&#x90E8;&#xFF0C;&#x4F60;&#x5C07;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#x770B;&#x5230;&#x3002;</p>
</div>
<div id="chain_of_blocks" class="imageblock smallerfourtyfive">
<div class="content">
<img src="images/mbc2_0901.png" alt="mbc2 0901.png">
</div>
<div class="title">Figure 1. Blocks linked in a chain by reference to the previous block header hash</div>
</div>
<div class="paragraph">
<p>&#x6BD4;&#x7279;&#x5E63;&#x4E2D;&#x4F7F;&#x7528;Merkle&#x6A39;&#x4F86;&#x5F59;&#x7E3D;&#x5340;&#x584A;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4EA4;&#x6613;&#xFF0C;&#x70BA;&#x6574;&#x500B;&#x4EA4;&#x6613;&#x96C6;&#x63D0;&#x4F9B;&#x5168;&#x9762;&#x7684;&#x6578;&#x5B57;&#x6307;&#x7D0B;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x500B;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x6D41;&#x7A0B;&#x4F86;&#x9A57;&#x8B49;&#x4EA4;&#x6613;&#x662F;&#x5426;&#x5305;&#x542B;&#x5728;&#x5340;&#x584A;&#x4E2D;&#x3002; Merkle&#x6A39;&#x662F;&#x901A;&#x904E;&#x5C0D;&#x7BC0;&#x9EDE;&#x5C0D;&#x5152;&#xFF08;pairs of nodes&#xFF09;&#x9032;&#x884C;&#x905E;&#x6B78;&#x96DC;&#x6E4A;&#x69CB;&#x9020;&#x7684;&#xFF0C;&#x76F4;&#x5230;&#x53EA;&#x6709;&#x4E00;&#x500B;&#x96DC;&#x6E4A;&#xFF0C;&#x7A31;&#x70BA; <em>root</em> &#x6216; <em>merkle root</em>&#x3002;&#x6BD4;&#x7279;&#x5E63;&#x7684;merkle&#x6A39;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x52A0;&#x5BC6;&#x96DC;&#x6E4A;&#x6F14;&#x7B97;&#x6CD5;&#x662F;&#x5C07;SHA256&#x61C9;&#x7528;&#x5169;&#x6B21;&#xFF0C;&#x4E5F;&#x7A31;&#x70BA;double-SHA256&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x7576;N&#x500B;&#x6578;&#x64DA;&#x5143;&#x7D20;&#x88AB;&#x96DC;&#x6E4A;&#x4E26;&#x5F59;&#x7E3D;&#x5230;&#x4E00;&#x500B;Merkle&#x6A39;&#x4E2D;&#x6642;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6AA2;&#x67E5;&#x6A39;&#x4E2D;&#x662F;&#x5426;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x4E00;&#x500B;&#x6578;&#x64DA;&#x5143;&#x7D20;&#xFF0C;&#x4E26;&#x4E14;&#x6700;&#x591A;&#x96BB;&#x9700; 2*log2~(N) &#x6B21;&#x8A08;&#x7B97;&#xFF0C;&#x56E0;&#x6B64;&#x9019;&#x662F;&#x4E00;&#x500B;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x8CC7;&#x6599;&#x7D50;&#x69CB;&#x3002;</p>
</div>
<div class="paragraph">
<p>Merkle&#x6A39;&#x662F;&#x81EA;&#x4E0B;&#x800C;&#x4E0A;&#x69CB;&#x5EFA;&#x7684;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x5011;&#x5F9E;&#x56DB;&#x500B;&#x4EA4;&#x6613;&#x958B;&#x59CB;&#xFF0C;A&#xFF0C;B&#xFF0C;C&#x548C;D&#xFF0C;&#x5B83;&#x5011;&#x69CB;&#x6210;&#x4E86;merkle&#x6A39;&#x7684; <em>&#x8449;&#x5B50;</em> <em>leaves</em>&#xFF0C;&#x5982; <a href="#simple_merkle">Calculating the nodes in a merkle tree</a> &#x6240;&#x793A;&#x3002;&#x4EA4;&#x6613;&#x4E0D;&#x5132;&#x5B58;&#x5728;merkle&#x6A39;&#x4E2D;&#xFF1B;&#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x5011;&#x7684;&#x6578;&#x64DA;&#x88AB;&#x96DC;&#x6E4A;&#x4E26;&#x4E14;&#x6240;&#x5F97;&#x5230;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#x88AB;&#x5132;&#x5B58;&#x5728;&#x6BCF;&#x500B;&#x8449;&#x7BC0;&#x9EDE;&#x4E2D;&#xFF0C;&#x5982; H<sub>A</sub>&#xFF0C;H<sub>B</sub>&#xFF0C;H<sub>C</sub> &#x548C; H<sub>D</sub>&#xFF1A;</p>
</div>
<pre data-type="codelisting">
H<sub>A</sub> = SHA256(SHA256(Transaction A))
</pre>
<div class="paragraph">
<p>&#x7136;&#x5F8C;&#x5C07;&#x9023;&#x7E8C;&#x7684;&#x8449;&#x7BC0;&#x9EDE;&#x5C0D;&#x5F59;&#x7E3D;&#x5230;&#x7236;&#x7BC0;&#x9EDE;&#x4E2D;&#xFF0C;&#x65B9;&#x6CD5;&#x662F;&#x9023;&#x63A5;&#x5169;&#x500B;&#x96DC;&#x6E4A;&#x503C;&#x4E26;&#x5C0D;&#x5B83;&#x5011;&#x9032;&#x884C;&#x96DC;&#x6E4A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8981;&#x69CB;&#x9020;&#x7236;&#x7BC0;&#x9EDE; H<sub>AB</sub>&#xFF0C;&#x5C07;&#x5B50;&#x7BC0;&#x9EDE;&#x7684;&#x5169;&#x500B;32&#x5B57;&#x7BC0;&#x96DC;&#x6E4A;&#x503C;&#x9023;&#x63A5;&#x8D77;&#x4F86;&#xFF0C;&#x4EE5;&#x5275;&#x5EFA;&#x4E00;&#x500B;64&#x5B57;&#x7BC0;&#x7684;&#x5B57;&#x4E32;&#x3002;&#x7136;&#x5F8C;&#x5C0D;&#x8A72;&#x5B57;&#x4E32;&#x9032;&#x884C;&#x96D9;&#x91CD;&#x96DC;&#x6E4A;&#x4F86;&#x7522;&#x751F;&#x7236;&#x7BC0;&#x9EDE;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#xFF1A;</p>
</div>
<pre data-type="codelisting">
H<sub>AB</sub> = SHA256(SHA256(H<sub>A</sub> + H<sub>B</sub>))
</pre>
<div class="paragraph">
<p>&#x7E7C;&#x7E8C;&#x8A72;&#x904E;&#x7A0B;&#xFF0C;&#x76F4;&#x5230;&#x9802;&#x90E8;&#x53EA;&#x6709;&#x4E00;&#x500B;&#x7BC0;&#x9EDE;&#xFF0C;&#x8A72;&#x7BC0;&#x9EDE;&#x88AB;&#x7A31;&#x70BA;merkle&#x6839;&#x3002;&#x8A72;32&#x5B57;&#x7BC0;&#x96DC;&#x6E4A;&#x503C;&#x5132;&#x5B58;&#x5728;&#x5340;&#x584A;&#x982D;&#x4E2D;&#xFF0C;&#x5F59;&#x7E3D;&#x4E86;&#x56DB;&#x500B;&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x6578;&#x64DA;&#x3002;<a href="#simple_merkle">Calculating the nodes in a merkle tree</a> &#x5C55;&#x793A;&#x77AD;&#x5982;&#x4F55;&#x901A;&#x904E;&#x7BC0;&#x9EDE;&#x7684;&#x6210;&#x5C0D;&#x96DC;&#x6E4A;&#x4F86;&#x8A08;&#x7B97;&#x6839;&#x3002;</p>
</div>
<div id="simple_merkle" class="imageblock">
<div class="content">
<img src="images/mbc2_0902.png" alt="merkle_tree">
</div>
<div class="title">Figure 2. Calculating the nodes in a merkle tree</div>
</div>
<div class="paragraph">
<p>&#x7531;&#x65BC;merkle&#x6A39;&#x662F;&#x4E8C;&#x5143;&#x6A39;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x5076;&#x6578;&#x500B;&#x8449;&#x7BC0;&#x9EDE;&#x3002;&#x5982;&#x679C;&#x8981;&#x5F59;&#x7E3D;&#x7684;&#x4EA4;&#x6613;&#x6578;&#x91CF;&#x70BA;&#x5947;&#x6578;&#xFF0C;&#x5247;&#x6700;&#x5F8C;&#x4E00;&#x500B;&#x4EA4;&#x6613;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#x5C07;&#x88AB;&#x8907;&#x5236;&#x4EE5;&#x5275;&#x5EFA;&#x5076;&#x6578;&#x500B;&#x8449;&#x7BC0;&#x9EDE;&#xFF0C;&#x9019;&#x7A31;&#x70BA; <em>&#x5E73;&#x8861;&#x7684;&#x6A39;</em> <em>balanced tree</em>&#x3002;&#x5728; &lt;&lt; merkle_tree_odd&gt;&gt; &#x4E2D;&#xFF0C;&#x4EA4;&#x6613;C&#x88AB;&#x8907;&#x5236;&#x3002;</p>
</div>
<div id="merkle_tree_odd" class="imageblock">
<div class="content">
<img src="images/mbc2_0903.png" alt="merkle_tree_odd">
</div>
<div class="title">Figure 3. Duplicating one data element achieves an even number of data elements</div>
</div>
<div class="paragraph">
<p>&#x4F7F;&#x7528;&#x56DB;&#x500B;&#x4EA4;&#x6613;&#x69CB;&#x9020;&#x6A39;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x63A8;&#x5EE3;&#x5230;&#x69CB;&#x9020;&#x4EFB;&#x610F;&#x5927;&#x5C0F;&#x7684;&#x6A39;&#x3002;&#x5728;&#x6BD4;&#x7279;&#x5E63;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x5728;&#x4E00;&#x500B;&#x5340;&#x584A;&#x4E2D;&#x6709;&#x5E7E;&#x767E;&#x5230;&#x5E7E;&#x5343;&#x500B;&#x4EA4;&#x6613;&#xFF0C;&#x9019;&#x4E9B;&#x4EA4;&#x6613;&#x7684;&#x5F59;&#x7E3D;&#x65B9;&#x5F0F;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#xFF0C;&#x50C5;&#x7522;&#x751F;&#x55AE;&#x500B;Merkle&#x6839;&#x7684;32&#x500B;&#x5B57;&#x7BC0;&#x7684;&#x6578;&#x64DA;&#x3002;&#x5728; <a href="#merkle_tree_large">A merkle tree summarizing many data elements</a> &#x4E2D;&#xFF0C;&#x4F60;&#x5C07;&#x770B;&#x5230;&#x4E00;&#x68F5;&#x7531;16&#x500B;&#x4EA4;&#x6613;&#x69CB;&#x6210;&#x7684;&#x6A39;&#x3002;&#x8ACB;&#x6CE8;&#x610F;&#xFF0C;&#x5118;&#x7BA1;&#x6839;&#x770B;&#x8D77;&#x4F86;&#x6BD4;&#x5716;&#x4E2D;&#x7684;&#x8449;&#x7BC0;&#x9EDE;&#x5927;&#xFF0C;&#x4F46;&#x5B83;&#x7684;&#x5927;&#x5C0F;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#xFF0C;&#x53EA;&#x6709;32&#x500B;&#x5B57;&#x7BC0;&#x3002;&#x7121;&#x8AD6;&#x5340;&#x584A;&#x4E2D;&#x662F;&#x5426;&#x6709;&#x4E00;&#x500B;&#x4EA4;&#x6613;&#x6216;&#x5341;&#x842C;&#x500B;&#x4EA4;&#x6613;&#xFF0C;merkle&#x6839;&#x7E3D;&#x662F;&#x5C07;&#x5B83;&#x5011;&#x7E3D;&#x7D50;&#x70BA;32&#x500B;&#x5B57;&#x7BC0;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x70BA;&#x4E86;&#x8B49;&#x660E;&#x4E00;&#x500B;&#x5340;&#x584A;&#x4E2D;&#x5305;&#x542B;&#x4E00;&#x500B;&#x7279;&#x5B9A;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x4E00;&#x500B;&#x7BC0;&#x9EDE;&#x53EA;&#x9700;&#x8981;&#x7522;&#x751F; log2~(N) &#x500B;32&#x500B;&#x5B57;&#x7BC0;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#xFF0C;&#x69CB;&#x6210;&#x4E00;&#x500B;&#x8A8D;&#x8B49; <em>path</em> &#x6216; <em>merkle_path</em>&#xFF0C;&#x5C07;&#x7279;&#x5B9A;&#x7684;&#x4EA4;&#x6613;&#x9023;&#x63A5;&#x5230;&#x6A39;&#x7684;&#x6839;&#x3002;&#x96A8;&#x8457;&#x4EA4;&#x6613;&#x6578;&#x91CF;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x9019;&#x4E00;&#x9EDE;&#x5C24;&#x70BA;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x70BA;&#x4EA4;&#x6613;&#x6578;&#x91CF;&#x7684;&#x57FA;&#x6578;&#x70BA;2&#x7684;&#x5C0D;&#x6578;&#x589E;&#x9577;&#x901F;&#x5EA6;&#x8981;&#x6162;&#x5F97;&#x591A;&#x3002;&#x9019;&#x4F7F;&#x5F97;&#x6BD4;&#x7279;&#x5E63;&#x7BC0;&#x9EDE;&#x80FD;&#x5920;&#x9AD8;&#x6548;&#x5730;&#x751F;&#x6210;10&#x6216;12&#x500B;&#x96DC;&#x6E4A;&#x503C;&#xFF08;320-384&#x5B57;&#x7BC0;&#xFF09;&#x7684;&#x8DEF;&#x5F91;&#xFF0C;&#x9019;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x5146;&#x5B57;&#x7BC0;&#x5927;&#x5C0F;&#x7684;&#x5340;&#x584A;&#x4E2D;&#x8D85;&#x904E;&#x4E00;&#x5343;&#x500B;&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x55AE;&#x500B;&#x4EA4;&#x6613;&#x7684;&#x9A57;&#x8B49;&#x3002;</p>
</div>
<div id="merkle_tree_large" class="imageblock">
<div class="content">
<img src="images/mbc2_0904.png" alt="merkle_tree_large">
</div>
<div class="title">Figure 4. A merkle tree summarizing many data elements</div>
</div>
<div class="paragraph">
<p>&#x5728; <a href="#merkle_tree_path">A merkle path used to prove inclusion of a data element</a> &#x4E2D;&#xFF0C;&#x7BC0;&#x9EDE;&#x53EF;&#x4EE5;&#x901A;&#x904E;&#x7522;&#x751F;&#x53EA;&#x6709;&#x56DB;&#x500B;32&#x5B57;&#x7BC0;&#x96DC;&#x6E4A;&#x9577;&#xFF08;&#x7E3D;&#x5171;128&#x5B57;&#x7BC0;&#xFF09;&#x7684;merkle&#x8DEF;&#x5F91;&#x4F86;&#x8B49;&#x660E;&#x4EA4;&#x6613;K&#x5305;&#x542B;&#x5728;&#x8A72;&#x5340;&#x584A;&#x4E2D;&#x3002;&#x8A72;&#x8DEF;&#x5F91;&#x7531;&#x56DB;&#x500B;&#x96DC;&#x6E4A;&#x503C;&#x7D44;&#x6210;&#xFF08; &#x5728; &lt;&lt; merkle_tree_path&gt;&gt; &#x5E36;&#x85CD;&#x8272;&#x80CC;&#x666F;&#x7684; &#xFF09;&#xFF0C;H<sub>L</sub>&#xFF0C;H<sub>IJ</sub>&#xFF0C;H<sub>MNOP</sub> &#x548C; H<sub>ABCDEFGH</sub>&#x3002;&#x901A;&#x904E;&#x63D0;&#x4F9B;&#x9019;&#x56DB;&#x500B;&#x96DC;&#x6E4A;&#x503C;&#x4F5C;&#x70BA;&#x9A57;&#x8B49;&#x8DEF;&#x5F91;&#xFF0C;&#x4EFB;&#x4F55;&#x7BC0;&#x9EDE;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x904E;&#x8A08;&#x7B97;&#x56DB;&#x500B;&#x984D;&#x5916;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#x4F86;&#x8B49;&#x660E; H<sub>K</sub>&#xFF08;&#x5E95;&#x90E8;&#x9ED1;&#x8272;&#x80CC;&#x666F;&#x7684;&#xFF09;&#x5305;&#x542B;&#x5728;Merkle&#x6839;&#x4E2D;&#xFF1A;H<sub>KL</sub>&#xFF0C;H<sub>IJKL</sub>&#xFF0C;H<sub>IJKLMNOP</sub> &#x548C;merkle&#x6A39;&#x6839;&#xFF08;&#x5728;&#x5716;&#x4E2D;&#x7528;&#x865B;&#x7DDA;&#x8868;&#x793A;&#xFF09;&#x3002;</p>
</div>
<div id="merkle_tree_path" class="imageblock">
<div class="content">
<img src="images/mbc2_0905.png" alt="merkle_tree_path">
</div>
<div class="title">Figure 5. A merkle path used to prove inclusion of a data element</div>
</div>
<div class="paragraph">
<p><a href="#merkle_example">Building a merkle tree</a> &#x4E2D;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x6F14;&#x793A;&#x77AD;&#x5982;&#x4F55;&#x4F7F;&#x7528;libbitcoin&#x7684;&#x4E00;&#x4E9B;&#x8F14;&#x52A9;&#x51FD;&#x6578;&#xFF0C;&#x5275;&#x5EFA;&#x5F9E;&#x8449;&#x7BC0;&#x9EDE;&#x96DC;&#x6E4A;&#x503C;&#x4E00;&#x76F4;&#x5230;&#x6839;&#x7684;Merkle&#x6A39;&#x3002;</p>
</div>
<div id="merkle_example" class="exampleblock pagebreak-before">
<div class="title">Example 1. Building a merkle tree</div>
<div class="content">
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-cpp" data-lang="cpp">link:code/merkle.cpp[]</code></pre>
</div>
</div>
</div>
</div>
<div class="paragraph">
<p><a href="#merkle_example_run">Compiling and running the merkle example code</a> &#x5C55;&#x793A;&#x4E86;&#x7DE8;&#x8B6F;&#x548C;&#x904B;&#x884C;&#x7D50;&#x679C;</p>
</div>
<div id="merkle_example_run" class="exampleblock">
<div class="title">Example 2. Compiling and running the merkle example code</div>
<div class="content">
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="language-bash" data-lang="bash">$ <span class="hljs-comment"># Compile the merkle.cpp code</span>
$ g++ -o merkle merkle.cpp $(pkg-config --cflags --libs libbitcoin)
$ <span class="hljs-comment"># Run the merkle executable</span>
$ ./merkle
Current merkle <span class="hljs-built_in">hash</span> list:
  32650049a0418e4380db0af81788635d8b65424d397170b8499cdc28c4d27006
  30861db96905c8dc8b99398ca1<span class="hljs-built_in">cd</span>5bd5b84ac3264a4e1b3e65afa1bcee7540c4

Current merkle <span class="hljs-built_in">hash</span> list:
  d47780c084bad3830bcdaf6eace035e4c6cbf646d103795d22104fb105014ba3

Result: d47780c084bad3830bcdaf6eace035e4c6cbf646d103795d22104fb105014ba3</code></pre>
</div>
</div>
</div>
</div>
<div class="paragraph">
<p>&#x96A8;&#x8457;&#x898F;&#x6A21;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x6885;&#x514B;&#x723E;&#x6A39;&#x7684;&#x6548;&#x7387;&#x8B8A;&#x5F97;&#x8D8A;&#x4F86;&#x8D8A;&#x660E;&#x986F;&#x3002; <a href="#block_structure2">Merkle tree efficiency</a> &#x5C55;&#x793A;&#x4E86;&#x8B49;&#x660E;&#x4EA4;&#x6613;&#x662F;&#x5340;&#x584A;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x9396;&#x9700;&#x8981;&#x7684;&#x4F5C;&#x70BA;merkle&#x8DEF;&#x5F91;&#x4EA4;&#x63DB;&#x7684;&#x6578;&#x64DA;&#x91CF;&#x3002;</p>
</div>
<table id="block_structure2" class="tableblock frame-all grid-all spread">
<caption class="title">Table 3. Merkle tree efficiency</caption>
<colgroup>
<col style="width: 25%;">
<col style="width: 25%;">
<col style="width: 25%;">
<col style="width: 25%;">
</colgroup>
<thead>
<tr>
<th class="tableblock halign-left valign-top">Number of transactions</th>
<th class="tableblock halign-left valign-top">Approx. size of block</th>
<th class="tableblock halign-left valign-top">Path size (hashes)</th>
<th class="tableblock halign-left valign-top">Path size (bytes)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">16 transactions</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">4 kilobytes</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">4 hashes</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">128 bytes</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">512 transactions</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">128 kilobytes</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">9 hashes</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">288 bytes</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">2048 transactions</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">512 kilobytes</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">11 hashes</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">352 bytes</p></td>
</tr>
<tr>
<td class="tableblock halign-left valign-top"><p class="tableblock">65,535 transactions</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">16 megabytes</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">16 hashes</p></td>
<td class="tableblock halign-left valign-top"><p class="tableblock">512 bytes</p></td>
</tr>
</tbody>
</table>
<div class="paragraph">
<p>&#x5F9E;&#x8868;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x5340;&#x584A;&#x5927;&#x5C0F;&#x5F9E;16&#x500B;&#x4EA4;&#x6613;&#x7684;4KB&#x5FEB;&#x901F;&#x589E;&#x52A0;&#x5230;65,535&#x500B;&#x4EA4;&#x6613;&#x7684;16MB&#xFF0C;&#x8B49;&#x660E;&#x4EA4;&#x6613;&#x5B58;&#x5728;&#x6240;&#x9700;&#x7684;Merkle&#x8DEF;&#x5F91;&#x5247;&#x589E;&#x52A0;&#x5F97;&#x5F88;&#x6162;&#xFF0C;&#x5F9E;128&#x5B57;&#x7BC0;&#x5230;&#x53EA;&#x6709;512&#x5B57;&#x7BC0;&#x3002;&#x4F7F;&#x7528;merkle&#x6A39;&#xFF0C;&#x7BC0;&#x9EDE;&#x53EF;&#x4EE5;&#x53EA;&#x4E0B;&#x8F09;&#x5340;&#x584A;&#x982D;&#xFF08;&#x6BCF;&#x5340;&#x584A;80&#x500B;&#x5B57;&#x7BC0;&#xFF09;&#xFF0C;&#x4E26;&#x4E14;&#x4ECD;&#x7136;&#x80FD;&#x5920;&#x901A;&#x904E;&#x5F9E;&#x5B8C;&#x6574;&#x7BC0;&#x9EDE;&#x6AA2;&#x7D22;&#x5C0F;&#x578B;merkle&#x8DEF;&#x5F91;&#x4F86;&#x8B49;&#x5BE6;&#x4EA4;&#x6613;&#x5305;&#x542B;&#x5728;&#x5340;&#x584A;&#x4E2D;&#xFF0C;&#x800C;&#x4E0D;&#x5132;&#x5B58;&#x6216;&#x50B3;&#x8F38;&#x7D55;&#x5927;&#x91CF;&#x7684;&#xFF08;&#x53EF;&#x80FD;&#x5E7E;&#x500B;GB&#xFF09;&#x5340;&#x584A;&#x93C8;&#x6578;&#x64DA;&#x3002;&#x4E0D;&#x7DAD;&#x8B77;&#x5B8C;&#x6574;&#x5340;&#x584A;&#x93C8;&#x7684;&#x7BC0;&#x9EDE;&#x7A31;&#x70BA;&#x7C21;&#x55AE;&#x652F;&#x4ED8;&#x9A57;&#x8B49;&#xFF08;SPV&#xFF09;&#x7BC0;&#x9EDE;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;merkle&#x8DEF;&#x5F91;&#x9A57;&#x8B49;&#x4EA4;&#x6613;&#x800C;&#x7121;&#x9700;&#x4E0B;&#x8F09;&#x5B8C;&#x6574;&#x5340;&#x584A;&#x3002;</p>
</div>
</div>
<div class="sect2">
<h3 id="_merkle">Merkle &#x6A39;&#x548C;&#x7C21;&#x55AE;&#x652F;&#x4ED8;&#x9A57;&#x8B49;&#x7BC0;&#x9EDE;</h3>
<div class="paragraph">
<p>Merkle&#x6A39;&#x88AB;SPV&#x7BC0;&#x9EDE;&#x5EE3;&#x6CDB;&#x4F7F;&#x7528;&#x3002; SPV&#x7BC0;&#x9EDE;&#x6C92;&#x6709;&#x5168;&#x90E8;&#x4EA4;&#x6613;&#xFF0C;&#x4E26;&#x4E14;&#x4E0D;&#x4E0B;&#x8F09;&#x5B8C;&#x6574;&#x7684;&#x5340;&#x584A;&#xFF0C;&#x53EA;&#x6709;&#x5340;&#x584A;&#x982D;&#x3002;&#x70BA;&#x4E86;&#x9A57;&#x8B49;&#x5340;&#x584A;&#x4E2D;&#x5305;&#x542B;&#x4EA4;&#x6613;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x4E0B;&#x8F09;&#x5340;&#x584A;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4EA4;&#x6613;&#xFF0C;&#x5B83;&#x5011;&#x4F7F;&#x7528;&#x9A57;&#x8B49;&#x8DEF;&#x5F91;&#xFF08;merkle&#x8DEF;&#x5F91;&#xFF09;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x616E;&#x4E00;&#x500B;SPV&#x7BC0;&#x9EDE;&#xFF0C;&#x5B83;&#x5C0D;&#x4ED8;&#x6B3E;&#x5230;&#x5B83;&#x7684;&#x9322;&#x5305;&#x4E2D;&#x5730;&#x5740;&#x7684;&#x4EA4;&#x6613;&#x611F;&#x8208;&#x8DA3;&#x3002;SPV&#x7BC0;&#x9EDE;&#x5C07;&#x5728;&#x5176;&#x8207;&#x5C0D;&#x7B49;&#x7BC0;&#x9EDE;&#x7684;&#x9023;&#x63A5;&#x4E0A;&#x5EFA;&#x7ACB;&#x4E00;&#x500B;&#x5E03;&#x6797;&#x904E;&#x6FFE;&#x5668;&#xFF08;&#x53C3;&#x898B; <a href="#bloom_filters">[bloom_filters]</a> &#xFF09;&#xFF0C;&#x5C07;&#x63A5;&#x6536;&#x5230;&#x7684;&#x4EA4;&#x6613;&#x9650;&#x5236;&#x70BA;&#x90A3;&#x4E9B;&#x53EA;&#x5305;&#x542B;&#x5176;&#x611F;&#x8208;&#x8DA3;&#x5730;&#x5740;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x7576;&#x5C0D;&#x7B49;&#x7BC0;&#x9EDE;&#x770B;&#x5230;&#x8207;bloom&#x904E;&#x6FFE;&#x5668;&#x5339;&#x914D;&#x7684;&#x4EA4;&#x6613;&#x6642;&#xFF0C;&#x5B83;&#x5C07;&#x4F7F;&#x7528; merkleblock &#x8A0A;&#x606F;&#x767C;&#x9001;&#x8A72;&#x5340;&#x584A;&#x3002;merkleblock &#x8A0A;&#x606F;&#x5305;&#x542B;&#x5340;&#x584A;&#x7684;&#x982D;&#xFF0C;&#x4EE5;&#x53CA;&#x5C07;&#x611F;&#x8208;&#x8DA3;&#x7684;&#x4EA4;&#x6613;&#x93C8;&#x63A5;&#x5230;&#x5340;&#x584A;&#x4E2D;&#x7684;merkle&#x6839;&#x7684;merkle&#x8DEF;&#x5F91;&#x3002;SPV&#x7BC0;&#x9EDE;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6B64;Merkle&#x8DEF;&#x5F91;&#x5C07;&#x4EA4;&#x6613;&#x9023;&#x63A5;&#x5230;&#x5340;&#x584A;&#x4E26;&#x9A57;&#x8B49;&#x4EA4;&#x6613;&#x662F;&#x5426;&#x5305;&#x542B;&#x5728;&#x5340;&#x584A;&#x4E2D;&#x3002; SPV&#x7BC0;&#x9EDE;&#x9084;&#x4F7F;&#x7528;&#x5340;&#x584A;&#x982D;&#x5C07;&#x5340;&#x584A;&#x93C8;&#x63A5;&#x5230;&#x5340;&#x584A;&#x93C8;&#x7684;&#x5176;&#x9918;&#x90E8;&#x5206;&#x3002;&#x4EA4;&#x6613;&#x548C;&#x5340;&#x584A;&#x4E4B;&#x9593;&#x4EE5;&#x53CA;&#x5340;&#x584A;&#x548C;&#x5340;&#x584A;&#x93C8;&#x4E4B;&#x9593;&#x7684;&#x9019;&#x5169;&#x500B;&#x93C8;&#x63A5;&#x7684;&#x7D44;&#x5408;&#x8B49;&#x660E;&#x4EA4;&#x6613;&#x8A18;&#x9304;&#x5728;&#x5340;&#x584A;&#x93C8;&#x4E2D;&#x3002;&#x7E3D;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;SPV&#x7BC0;&#x9EDE;&#x5C07;&#x63A5;&#x6536;&#x5230;&#x5C11;&#x65BC;&#x4E00;&#x5343;&#x5B57;&#x7BC0;&#x7684;&#x6578;&#x64DA;&#x5340;&#x584A;&#x982D;&#x548C;merkle&#x8DEF;&#x5F91;&#xFF0C;&#x5176;&#x6578;&#x64DA;&#x91CF;&#x6BD4;&#x5B8C;&#x6574;&#x5340;&#x584A;&#xFF08;&#x7576;&#x524D;&#x5927;&#x7D04;1&#x5146;&#x5B57;&#x7BC0;&#xFF09;&#x5C11;&#x4E00;&#x5343;&#x500D;&#x4EE5;&#x4E0A;&#x3002;</p>
</div>
</div>
<div class="sect2">
<h3 id="___5">&#x6BD4;&#x7279;&#x5E63;&#x7684;&#x6E2C;&#x8A66;&#x5340;&#x584A;&#x93C8;</h3>
<div class="paragraph">
<p>&#x4F60;&#x53EF;&#x80FD;&#x6703;&#x9A5A;&#x8A1D;&#x5730;&#x767C;&#x73FE;&#x6709;&#x591A;&#x500B;&#x6BD4;&#x7279;&#x5E63;&#x5340;&#x584A;&#x93C8;&#x3002; 2009&#x5E74;1&#x6708;3&#x65E5;&#x7531;&#x4E2D;&#x672C;&#x8070;&#x5275;&#x5EFA;&#x7684;&#x201C;&#x4E3B;&#x201D;&#x6BD4;&#x7279;&#x5E63;&#x5340;&#x584A;&#x93C8;&#xFF0C;&#x5E36;&#x6709;&#x6211;&#x5011;&#x672C;&#x7AE0;&#x7814;&#x7A76;&#x7684;&#x5275;&#x4E16;&#x5340;&#x584A;&#xFF0C;&#x88AB;&#x7A31;&#x70BA; <em>&#x4E3B;&#x7DB2;</em> <em>mainnet</em>&#x3002;&#x9084;&#x6709;&#x5176;&#x4ED6;&#x7528;&#x65BC;&#x6E2C;&#x8A66;&#x7684;&#x6BD4;&#x7279;&#x5E63;&#x5340;&#x584A;&#x93C8;&#xFF0C;&#x73FE;&#x5728;&#x6709;&#xFF1A;<em>testnet</em>&#xFF0C;<em>segnet</em> &#x548C; <em>regtest</em>&#x3002;&#x8B93;&#x6211;&#x5011;&#x4F9D;&#x6B21;&#x770B;&#x4E0B;&#x3002;</p>
</div>
<div class="sect3">
<h4 id="___6">&#x6E2C;&#x8A66;&#x7DB2;&#x8DEF; &#x2014;&#x2014; &#x6BD4;&#x7279;&#x5E63;&#x7684;&#x6E2C;&#x8A66;&#x5834;</h4>
<div class="paragraph">
<p>Testnet&#x662F;&#x7528;&#x65BC;&#x6E2C;&#x8A66;&#x76EE;&#x7684;&#x7684;&#x6E2C;&#x8A66;&#x5340;&#x584A;&#x93C8;&#xFF0C;&#x7DB2;&#x8DEF;&#x548C;&#x8CA8;&#x5E63;&#x7684;&#x540D;&#x7A31;&#x3002;&#x6E2C;&#x8A66;&#x7DB2;&#x662F;&#x4E00;&#x500B;&#x5168;&#x529F;&#x80FD;&#x7684;&#x6D3B;&#x8E8D;P2P&#x7DB2;&#x8DEF;&#xFF0C;&#x5305;&#x62EC;&#x9322;&#x5305;&#xFF0C;&#x6E2C;&#x8A66;&#x6BD4;&#x7279;&#x5E63;&#xFF08;testnet&#x786C;&#x5E63;&#xFF09;&#xFF0C;&#x6316;&#x7926;&#x4EE5;&#x53CA; mainnet &#x7684;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x529F;&#x80FD;&#x3002;&#x5BE6;&#x969B;&#x4E0A;&#x53EA;&#x6709;&#x5169;&#x500B;&#x5340;&#x5225;&#xFF1A;&#x6E2C;&#x8A66;&#x7DB2;&#x9EDE;&#x7684;&#x786C;&#x5E63;&#x50F9;&#x503C;&#x5F88;&#x4F4E;&#xFF0C;&#x6316;&#x7926;&#x96E3;&#x5EA6;&#x61C9;&#x8A72;&#x8DB3;&#x5920;&#x4F4E;&#xFF0C;&#x4EE5;&#x4FBF;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x76F8;&#x5C0D;&#x5BB9;&#x6613;&#x5730;&#x958B;&#x63A1;&#x6E2C;&#x8A66;&#x7DB2;&#x786C;&#x5E63;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x4EFB;&#x4F55;&#x64EC;&#x7528;&#x65BC;&#x6BD4;&#x7279;&#x5E63;&#x4E3B;&#x7DB2;&#x751F;&#x7522;&#x7684;&#x8EDF;&#x9AD4;&#x958B;&#x767C;&#x61C9;&#x9996;&#x5148;&#x4F7F;&#x7528;&#x6E2C;&#x8A66;&#x5E63;&#x5728;&#x6E2C;&#x8A66;&#x7DB2;&#x4E0A;&#x9032;&#x884C;&#x6E2C;&#x8A66;&#x3002;&#x9019;&#x53EF;&#x4EE5;&#x4FDD;&#x8B77;&#x958B;&#x767C;&#x4EBA;&#x54E1;&#x514D;&#x53D7;&#x7531;&#x65BC;&#x932F;&#x8AA4;&#x5C0E;&#x81F4;&#x7684;&#x8CC7;&#x91D1;&#x640D;&#x5931;&#xFF0C;&#x4E26;&#x4FDD;&#x8B77;&#x7DB2;&#x8DEF;&#x514D;&#x53D7;&#x7531;&#x65BC;&#x932F;&#x8AA4;&#x5C0E;&#x81F4;&#x7684;&#x610F;&#x5916;&#x884C;&#x70BA;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x7136;&#x800C;&#xFF0C;&#x4FDD;&#x6301;&#x786C;&#x5E63;&#x6BEB;&#x7121;&#x50F9;&#x503C;&#x4E26;&#x4E14;&#x5BB9;&#x6613;&#x6316;&#x6398;&#xFF0C;&#x4E26;&#x4E0D;&#x5BB9;&#x6613;&#x3002;&#x5118;&#x7BA1;&#x958B;&#x767C;&#x8005;&#x63D0;&#x51FA;&#x4E86;&#x8981;&#x6C42;&#xFF0C;&#x4F46;&#x6709;&#x4E9B;&#x4EBA;&#x4F7F;&#x7528;&#x9AD8;&#x7D1A;&#x63A1;&#x7926;&#x8A2D;&#x5099;&#xFF08;GPU&#x548C;ASIC&#xFF09;&#x5728;&#x6E2C;&#x8A66;&#x7DB2;&#x4E0A;&#x9032;&#x884C;&#x6316;&#x6398;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x96E3;&#x5EA6;&#xFF0C;&#x4F7F;&#x5F97;&#x4E0D;&#x53EF;&#x80FD;&#x7528;CPU&#x9032;&#x884C;&#x6316;&#x6398;&#xFF0C;&#x6700;&#x7D42;&#x4F7F;&#x5176;&#x96E3;&#x4EE5;&#x7372;&#x5F97;&#xFF0C;&#x4EBA;&#x5011;&#x958B;&#x59CB;&#x8A55;&#x4F30;&#x5B83;&#x5011;&#x7684;&#x50F9;&#x503C;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x5011;&#x4E5F;&#x4E0D;&#x662F;&#x6BEB;&#x7121;&#x50F9;&#x503C;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x73FE;&#x5728;&#x6216;&#x8005;&#x4E4B;&#x5F8C;&#xFF0C;&#x6E2C;&#x8A66;&#x7DB2;&#x5FC5;&#x9808;&#x88AB;&#x5EE2;&#x68C4;&#x4E26;&#x5F9E;&#x65B0;&#x7684;&#x5275;&#x4E16;&#x5340;&#x584A;&#x91CD;&#x65B0;&#x555F;&#x52D5;&#xFF0C;&#x91CD;&#x65B0;&#x8A2D;&#x7F6E;&#x96E3;&#x5EA6;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x7576;&#x524D;&#x7684;&#x6E2C;&#x8A66;&#x7DB2;&#x6210;&#x70BA; <em>testnet3</em>&#xFF0C;&#x7B2C;&#x4E09;&#x4EE3; testnet&#xFF0C;2011&#x5E74;2&#x6708;&#x91CD;&#x555F;&#xFF0C;&#x91CD;&#x7F6E;&#x4E86;&#x524D;&#x4E00;&#x4EE3;&#x6E2C;&#x8A66;&#x7DB2;&#x7684;&#x96E3;&#x5EA6;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x8ACB;&#x8A18;&#x4F4F;&#xFF0C;testnet3&#x662F;&#x4E00;&#x500B;&#x5927;&#x578B;&#x7684;&#x5340;&#x584A;&#x93C8;&#xFF0C;2017&#x5E74;&#x521D;&#x8D85;&#x904E;&#x4E86;20GB&#x3002;&#x8017;&#x76E1;&#x96FB;&#x8166;&#x8CC7;&#x6E90;&#x5B8C;&#x5168;&#x540C;&#x6B65;&#x9700;&#x8981;&#x4E00;&#x5929;&#x5DE6;&#x53F3;&#x7684;&#x6642;&#x9593;&#x3002;&#x4E0D;&#x5982;mainnet&#x5927;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x662F;&#x201C;&#x8F15;&#x91CF;&#x7D1A;&#x201D;&#x7684;&#x3002;&#x904B;&#x884C;&#x6E2C;&#x8A66;&#x7DB2;&#x8DEF;&#x7BC0;&#x9EDE;&#x7684;&#x4E00;&#x500B;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F5C;&#x70BA;&#x5C08;&#x7528;&#x65BC;&#x6B64;&#x76EE;&#x7684;&#x7684;&#x865B;&#x64EC;&#x6A5F;&#x6620;&#x50CF;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;VirtualBox&#xFF0C;Docker&#xFF0C;&#x96F2;&#x4F3A;&#x670D;&#x5668;&#x7B49;&#xFF09;&#x3002;</p>
</div>
<div class="sect4">
<h5 id="___7">&#x4F7F;&#x7528;&#x6E2C;&#x8A66;&#x7DB2;</h5>
<div class="paragraph">
<p>&#x50CF;&#x5E7E;&#x4E4E;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x6BD4;&#x7279;&#x5E63;&#x8EDF;&#x9AD4;&#x4E00;&#x6A23;&#xFF0C;Bitcoin Core&#x5B8C;&#x5168;&#x652F;&#x6301;&#x5728;testnet&#x800C;&#x4E0D;&#x662F;mainnet&#x4E0A;&#x904B;&#x884C;&#x3002;&#x6BD4;&#x7279;&#x5E63;&#x6838;&#x5FC3;&#x7684;&#x6240;&#x6709;&#x529F;&#x80FD;&#x90FD;&#x5728;&#x6E2C;&#x8A66;&#x7DB2;&#x8DEF;&#x4E0A;&#x904B;&#x884C;&#xFF0C;&#x5305;&#x62EC;&#x9322;&#x5305;&#xFF0C;&#x958B;&#x63A1;&#x6E2C;&#x8A66;&#x7DB2;&#x7684;&#x5E63;&#xFF0C;&#x4EE5;&#x53CA;&#x540C;&#x6B65;&#x5B8C;&#x6574;&#x7684;&#x6E2C;&#x8A66;&#x7DB2;&#x7BC0;&#x9EDE;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x8981;&#x5728;&#x6E2C;&#x8A66;&#x7DB2;&#x4E0A;&#x555F;&#x52D5; Bitcoin Core&#xFF0C;&#x4F7F;&#x7528; testnet &#x9078;&#x9805;&#xFF1A;</p>
</div>
<div class="listingblock">
<div class="content">
<pre>$ bitcoind -testnet</pre>
</div>
</div>
<div class="paragraph">
<p>&#x5728;&#x65E5;&#x8A8C;&#x4E2D;&#xFF0C;&#x4F60;&#x61C9;&#x8A72;&#x770B;&#x5230;bitcoind&#x6B63;&#x5728;&#x9810;&#x8A2D;bitcoind&#x76EE;&#x9304;&#x7684; testnet3 &#x5B50;&#x76EE;&#x9304;&#x4E2D;&#x69CB;&#x5EFA;&#x65B0;&#x7684;&#x5340;&#x584A;&#x93C8;&#xFF1A;</p>
</div>
<div class="listingblock">
<div class="content">
<pre>bitcoind: Using data directory /home/username/.bitcoin/testnet3</pre>
</div>
</div>
<div class="paragraph">
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; bitcoin-cli &#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#x9023;&#x63A5;&#x5230;bitcoind&#xFF0C;&#x4F46;&#x4E5F;&#x5FC5;&#x9808;&#x5C07;&#x5176;&#x5207;&#x63DB;&#x5230;testnet&#x6A21;&#x5F0F;&#xFF1A;</p>
</div>
<div class="listingblock">
<div class="content">
<pre>$ bitcoin-cli -testnet getblockchaininfo
{
  &quot;chain&quot;: &quot;test&quot;,
  &quot;blocks&quot;: 1088,
  &quot;headers&quot;: 139999,
  &quot;bestblockhash&quot;: &quot;0000000063d29909d475a1c4ba26da64b368e56cce5d925097bf3a2084370128&quot;,
  &quot;difficulty&quot;: 1,
  &quot;mediantime&quot;: 1337966158,
  &quot;verificationprogress&quot;: 0.001644065914099759,
  &quot;chainwork&quot;: &quot;0000000000000000000000000000000000000000000000000000044104410441&quot;,
  &quot;pruned&quot;: false,
  &quot;softforks&quot;: [

  [...]</pre>
</div>
</div>
<div class="paragraph">
<p>&#x4F60;&#x9084;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x5B8C;&#x6574;&#x7BC0;&#x9EDE;&#x5BE6;&#x73FE;&#xFF08;&#x5982; btcd&#xFF08;&#x7528;Go&#x7DE8;&#x5BEB;&#xFF09;&#x548C; bcoin&#xFF08;&#x7528;JavaScript&#x7DE8;&#x5BEB;&#xFF09;&#xFF09;&#x5728;testnet3&#x4E0A;&#x904B;&#x884C;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x5176;&#x4ED6;&#x7A0B;&#x5F0F;&#x8A9E;&#x8A00;&#x548C;&#x6846;&#x67B6;&#x4E2D;&#x9032;&#x884C;&#x5BE6;&#x9A57;&#x548C;&#x5B78;&#x7FD2;&#x3002;</p>
</div>
<div class="paragraph">
<p>2017&#x5E74;&#x521D;&#xFF0C;testnet3&#x652F;&#x6301;&#x4E86;mainnet&#x7684;&#x6240;&#x6709;&#x529F;&#x80FD;&#xFF0C;&#x5305;&#x62EC;&#x9694;&#x96E2;&#x898B;&#x8B49;&#xFF08;&#x53C3;&#x898B; <a href="#segwit">[segwit]</a>&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;testnet3&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4F86;&#x6E2C;&#x8A66;&#x9694;&#x96E2;&#x898B;&#x8B49;&#x529F;&#x80FD;&#x3002;</p>
</div>
</div>
</div>
<div class="sect3">
<h4 id="_segnet">Segnet &#x2014;&#x2014; &#x9694;&#x96E2;&#x898B;&#x8B49;&#x6E2C;&#x8A66;&#x7DB2;</h4>
<div class="paragraph">
<p>2016&#x5E74;&#x555F;&#x52D5;&#x4E86;&#x4E00;&#x500B;&#x7279;&#x6B8A;&#x7528;&#x9014;&#x7684;&#x6E2C;&#x8A66;&#x7DB2;&#xFF0C;&#x5E6B;&#x52A9;&#x958B;&#x767C;&#x548C;&#x6E2C;&#x8A66;&#x9694;&#x96E2;&#x898B;&#x8B49;&#xFF08;&#x53C8;&#x540D;segwit&#xFF1B;&#x898B; <a href="#segwit">[segwit]</a>&#xFF09;&#x3002;&#x8A72;&#x6E2C;&#x8A66;&#x5340;&#x584A;&#x93C8;&#x88AB;&#x7A31;&#x70BA; segnet&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x904E;&#x904B;&#x884C;&#x6BD4;&#x7279;&#x5E63;&#x6838;&#x5FC3;&#x7684;&#x7279;&#x6B8A;&#x7248;&#x672C;&#xFF08;&#x5206;&#x652F;&#xFF09;&#x52A0;&#x5165;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x7531;&#x65BC;segwit&#x5DF2;&#x6DFB;&#x52A0;&#x5230;testnet3&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x4F7F;&#x7528;segnet&#x4F86;&#x6E2C;&#x8A66;segwit&#x529F;&#x80FD;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x672A;&#x4F86;&#xFF0C;&#x6211;&#x5011;&#x53EF;&#x80FD;&#x6703;&#x770B;&#x5230;&#x5176;&#x4ED6;&#x50CF;segnet&#x4E00;&#x6A23;&#xFF0C;&#x5C08;&#x9580;&#x8A2D;&#x8A08;&#x7528;&#x65BC;&#x6E2C;&#x8A66;&#x55AE;&#x500B;&#x529F;&#x80FD;&#x6216;&#x4E3B;&#x8981;&#x67B6;&#x69CB;&#x66F4;&#x6539;&#x7684;testnet&#x5340;&#x584A;&#x93C8;&#x3002;</p>
</div>
</div>
<div class="sect3">
<h4 id="_regtest">Regtest &#x2014;&#x2014; &#x672C;&#x5730;&#x5340;&#x584A;&#x93C8;</h4>
<div class="paragraph">
<p>Regtest&#x4EE3;&#x8868;&#x201C;&#x8FF4;&#x6B78;&#x6E2C;&#x8A66;&#x201D;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x7A2E;&#x6BD4;&#x7279;&#x5E63;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF0C;&#x5141;&#x8A31;&#x4F60;&#x70BA;&#x6E2C;&#x8A66;&#x76EE;&#x7684;&#x5275;&#x5EFA;&#x672C;&#x5730;&#x5340;&#x584A;&#x93C8;&#x3002;&#x8207;&#x516C;&#x5171;&#x6E2C;&#x8A66;&#x5340;&#x584A;&#x93C8;testnet3&#x4E0D;&#x540C;&#xFF0C;regtest&#x5340;&#x584A;&#x93C8;&#x65E8;&#x5728;&#x4F5C;&#x70BA;&#x5C01;&#x9589;&#x7CFB;&#x7D71;&#x904B;&#x884C;&#x4EE5;&#x9032;&#x884C;&#x672C;&#x5730;&#x6E2C;&#x8A66;&#x3002;&#x4F60;&#x5F9E;&#x96F6;&#x958B;&#x59CB;&#x555F;&#x52D5;&#x4E00;&#x500B;regtest&#x5340;&#x584A;&#x93C8;&#xFF0C;&#x5275;&#x5EFA;&#x4E00;&#x500B;&#x672C;&#x5730;&#x5275;&#x4E16;&#x5340;&#x584A;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5C07;&#x5176;&#x4ED6;&#x7BC0;&#x9EDE;&#x6DFB;&#x52A0;&#x5230;&#x7DB2;&#x8DEF;&#xFF0C;&#x6216;&#x8005;&#x50C5;&#x4F7F;&#x7528;&#x55AE;&#x500B;&#x7BC0;&#x9EDE;&#x904B;&#x884C;&#x5B83;&#x4F86;&#x6E2C;&#x8A66;&#x6BD4;&#x7279;&#x5E63;&#x6838;&#x5FC3;&#x8EDF;&#x9AD4;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x8981;&#x4EE5; regtest &#x6A21;&#x5F0F;&#x555F;&#x52D5; Bitcoin Core&#xFF0C;&#x4F7F;&#x7528; regtest &#x9078;&#x9805;&#xFF1A;</p>
</div>
<div class="listingblock">
<div class="content">
<pre>$ bitcoind -regtest</pre>
</div>
</div>
<div class="paragraph">
<p>&#x8207;testnet&#x4E00;&#x6A23;&#xFF0C;Bitcoin Core&#x6703;&#x5728;&#x4F60;&#x7684;bitcoind&#x9810;&#x8A2D;&#x76EE;&#x9304;&#x7684; <em>regtest</em> &#x5B50;&#x76EE;&#x9304;&#x4E0B;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x500B;&#x65B0;&#x7684;&#x5340;&#x584A;&#x93C8;&#xFF1A;</p>
</div>
<div class="listingblock">
<div class="content">
<pre>bitcoind: Using data directory /home/username/.bitcoin/regtest</pre>
</div>
</div>
<div class="paragraph">
<p>&#x8981;&#x4F7F;&#x7528;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x6307;&#x5B9A; regtest &#x6A19;&#x8A8C;&#xFF1A;</p>
</div>
<div class="listingblock">
<div class="content">
<pre>$ bitcoin-cli -regtest getblockchaininfo
{
  &quot;chain&quot;: &quot;regtest&quot;,
  &quot;blocks&quot;: 0,
  &quot;headers&quot;: 0,
  &quot;bestblockhash&quot;: &quot;0f9188f13cb7b2c71f2a335e3a4fc328bf5beb436012afca590b1a11466e2206&quot;,
  &quot;difficulty&quot;: 4.656542373906925e-10,
  &quot;mediantime&quot;: 1296688602,
  &quot;verificationprogress&quot;: 1,
  &quot;chainwork&quot;: &quot;0000000000000000000000000000000000000000000000000000000000000002&quot;,
  &quot;pruned&quot;: false,
  [...]</pre>
</div>
</div>
<div class="paragraph">
<p>&#x5982;&#x4F60;&#x6240;&#x898B;&#xFF0C;&#x73FE;&#x5728;&#x9084;&#x6C92;&#x6709;&#x5340;&#x584A;&#x3002;&#x8B93;&#x6211;&#x5011;&#x6316;&#x6398;&#x4E00;&#x4E9B;&#xFF08;500&#x5340;&#x584A;&#xFF09;&#x4E26;&#x7372;&#x5F97;&#x734E;&#x52F5;&#xFF1A;</p>
</div>
<div class="listingblock">
<div class="content">
<pre>$ bitcoin-cli -regtest generate 500
[
  &quot;7afed70259f22c2bf11e406cb12ed5c0657b6e16a6477a9f8b28e2046b5ba1ca&quot;,
  &quot;1aca2f154a80a9863a9aac4c72047a6d3f385c4eec5441a4aafa6acaa1dada14&quot;,
  &quot;4334ecf6fb022f30fbd764c3ee778fabbd53b4a4d1950eae8a91f1f5158ed2d1&quot;,
  &quot;5f951d34065efeaf64e54e91d00b260294fcdfc7f05dbb5599aec84b957a7766&quot;,
  &quot;43744b5e77c1dfece9d05ab5f0e6796ebe627303163547e69e27f55d0f2b9353&quot;,
   [...]
  &quot;6c31585a48d4fc2b3fd25521f4515b18aefb59d0def82bd9c2185c4ecb754327&quot;
]</pre>
</div>
</div>
<div class="paragraph">
<p>&#x53EA;&#x9700;&#x8981;&#x5E7E;&#x79D2;&#x9418;&#x7684;&#x6642;&#x9593;&#x4F86;&#x6316;&#x6398;&#x6240;&#x6709;&#x9019;&#x4E9B;&#x5340;&#x584A;&#xFF0C;&#x9019;&#x4F7F;&#x5F97;&#x6E2C;&#x8A66;&#x5F88;&#x5BB9;&#x6613;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6AA2;&#x67E5;&#x4F60;&#x7684;&#x9322;&#x5305;&#x9918;&#x984D;&#xFF0C;&#x4F60;&#x6703;&#x770B;&#x5230;&#x4F60;&#x7372;&#x5F97;&#x4E86;&#x524D;400&#x500B;&#x5340;&#x584A;&#x7684;&#x734E;&#x52F5;&#xFF08;coinbase&#x734E;&#x52F5;&#x5FC5;&#x9808;&#x9054;&#x5230;&#x5728;100&#x500B;&#x5340;&#x584A;&#x5F8C;&#x624D;&#x53EF;&#x4EE5;&#x6D88;&#x8CBB;&#xFF09;&#xFF1A;</p>
</div>
<div class="listingblock">
<div class="content">
<pre>$ bitcoin-cli -regtest getbalance
12462.50000000</pre>
</div>
</div>
</div>
</div>
<div class="sect2">
<h3 id="___8">&#x4F7F;&#x7528;&#x6E2C;&#x8A66;&#x5340;&#x584A;&#x93C8;&#x9032;&#x884C;&#x958B;&#x767C;</h3>
<div class="paragraph">
<p>&#x6BD4;&#x7279;&#x5E63;&#x7684;&#x5404;&#x7A2E;&#x5340;&#x584A;&#x93C8;&#xFF08; regtest&#xFF0C;segnet&#xFF0C;testnet3&#xFF0C;mainnet&#xFF09;&#x70BA;&#x6BD4;&#x7279;&#x5E63;&#x958B;&#x767C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x6E2C;&#x8A66;&#x74B0;&#x5883;&#x3002;&#x7121;&#x8AD6;&#x4F60;&#x662F;&#x70BA;Bitcoin Core&#x958B;&#x767C;&#x9084;&#x662F;&#x53E6;&#x4E00;&#x500B;&#x5B8C;&#x6574;&#x7BC0;&#x9EDE;&#x5171;&#x8B58;&#x5BA2;&#x6236;&#x7AEF;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6E2C;&#x8A66;&#x5340;&#x584A;&#x93C8;&#x3002;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#xFF0C;&#x5982;&#x9322;&#x5305;&#xFF0C;&#x4EA4;&#x63DB;&#xFF0C;&#x96FB;&#x5B50;&#x5546;&#x52D9;&#x7DB2;&#x7AD9;&#xFF1B;&#x751A;&#x81F3;&#x958B;&#x767C;&#x65B0;&#x7A4E;&#x7684;&#x667A;&#x80FD;&#x5408;&#x7D04;&#x548C;&#x8907;&#x96DC;&#x7684;&#x8173;&#x672C;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6E2C;&#x8A66;&#x5340;&#x584A;&#x93C8;&#x5EFA;&#x7ACB;&#x958B;&#x767C;&#x7BA1;&#x9053;&#x3002;&#x958B;&#x767C;&#x6642;&#xFF0C;&#x5728; regtest &#x4E0A;&#x672C;&#x5730;&#x6E2C;&#x8A66;&#x4F60;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x3002;&#x4E00;&#x65E6;&#x6E96;&#x5099;&#x597D;&#x5728;&#x516C;&#x5171;&#x7DB2;&#x8DEF;&#x4E0A;&#x5617;&#x8A66;&#x5B83;&#xFF0C;&#x5207;&#x63DB;&#x5230; testnet &#x4EE5;&#x5C07;&#x7A0B;&#x5F0F;&#x78BC;&#x66B4;&#x9732;&#x65BC;&#x6709;&#x591A;&#x7A2E;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x548C;&#x61C9;&#x7528;&#x7684;&#xFF0C;&#x66F4;&#x5177;&#x52D5;&#x614B;&#x6027;&#x7684;&#x74B0;&#x5883;&#x4E2D;&#x3002;&#x6700;&#x5F8C;&#xFF0C;&#x4E00;&#x65E6;&#x4F60;&#x78BA;&#x4FE1;&#x81EA;&#x5DF1;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x80FD;&#x5920;&#x6309;&#x9810;&#x671F;&#x5DE5;&#x4F5C;&#xFF0C;&#x8ACB;&#x5207;&#x63DB;&#x5230; mainnet &#x4EE5;&#x5728;&#x751F;&#x7522;&#x74B0;&#x5883;&#x4E2D;&#x9032;&#x884C;&#x90E8;&#x7F72;&#x3002;&#x7576;&#x4F60;&#x9032;&#x884C;&#x66F4;&#x6539;&#xFF0C;&#x6539;&#x9032;&#xFF0C;&#x932F;&#x8AA4;&#x4FEE;&#x5FA9;&#x7B49;&#x6642;&#xFF0C;&#x8ACB;&#x518D;&#x6B21;&#x555F;&#x52D5;&#x7BA1;&#x9053;&#xFF0C;&#x9996;&#x5148;&#x662F; regtest&#xFF0C;&#x7136;&#x5F8C;&#x662F; testnet&#xFF0C;&#x6700;&#x5F8C;&#x90E8;&#x7F72;&#x5230;&#x751F;&#x7522;&#x74B0;&#x5883;&#x4E2D;&#x3002;</p>
</div>
</div>
</div>
</div>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="第八章.html" class="navigation navigation-prev " aria-label="Previous page: 第八章 比特幣網路">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="第十章.html" class="navigation navigation-next " aria-label="Next page: 第十章 挖礦和共識">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第九章 區塊鏈","level":"1.12","depth":1,"next":{"title":"第十章 挖礦和共識","level":"1.13","depth":1,"path":"第十章.asciidoc","ref":"第十章.asciidoc","articles":[]},"previous":{"title":"第八章 比特幣網路","level":"1.11","depth":1,"path":"第八章.asciidoc","ref":"第八章.asciidoc","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"第九章.asciidoc","mtime":"2019-08-26T14:07:59.539Z","type":"asciidoc"},"gitbook":{"version":"3.2.3","time":"2019-08-26T16:29:09.176Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

