
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十一章 比特幣安全 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="第十二章.html" />
    
    
    <link rel="prev" href="第十章.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="前言.html">
            
                <a href="前言.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="術語.html">
            
                <a href="術語.html">
            
                    
                    術語
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="第一章.html">
            
                <a href="第一章.html">
            
                    
                    第一章 概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="第二章.html">
            
                <a href="第二章.html">
            
                    
                    第二章 比特幣如何運作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="第三章.html">
            
                <a href="第三章.html">
            
                    
                    第三章 Bitcoin Core參考實現
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="第四章.html">
            
                <a href="第四章.html">
            
                    
                    第四章 密鑰和地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="第五章.html">
            
                <a href="第五章.html">
            
                    
                    第五章 錢包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="第六章.html">
            
                <a href="第六章.html">
            
                    
                    第六章 交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="第七章.html">
            
                <a href="第七章.html">
            
                    
                    第七章 高級交易和腳本
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="第八章.html">
            
                <a href="第八章.html">
            
                    
                    第八章 比特幣網路
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="第九章.html">
            
                <a href="第九章.html">
            
                    
                    第九章 區塊鏈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="第十章.html">
            
                <a href="第十章.html">
            
                    
                    第十章 挖礦和共識
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.14" data-path="第十一章.html">
            
                <a href="第十一章.html">
            
                    
                    第十一章 比特幣安全
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="第十二章.html">
            
                <a href="第十二章.html">
            
                    
                    第十二章 區塊鏈應用
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第十一章 比特幣安全</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div class="sect1">
<h2 id="ch11">&#x6BD4;&#x7279;&#x5E63;&#x7684;&#x5B89;&#x5168;</h2>
<div class="sectionbody">
<div class="paragraph">
<p>&#x78BA;&#x4FDD;&#x6BD4;&#x7279;&#x5E63;&#x5B89;&#x5168;&#x5177;&#x6709;&#x6311;&#x6230;&#x6027;&#xFF0C;&#x56E0;&#x70BA;&#x6BD4;&#x7279;&#x5E63;&#x4E0D;&#x662F;&#x62BD;&#x8C61;&#x7684;&#x50F9;&#x503C;&#x53C3;&#x8003;&#xFF0C;&#x5C31;&#x50CF;&#x9280;&#x884C;&#x8CEC;&#x6236;&#x7684;&#x9918;&#x984D;&#x3002;&#x6BD4;&#x7279;&#x5E63;&#x975E;&#x5E38;&#x50CF;&#x6578;&#x5B57;&#x73FE;&#x91D1;&#x6216;&#x9EC3;&#x91D1;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x807D;&#x5230;&#x904E;&#x9019;&#x6A23;&#x7684;&#x8868;&#x9054;&#xFF1A;&#x201C;&#x4F54;&#x6709;&#x662F;&#x6CD5;&#x5F8B;&#x7684;&#x5341;&#x5206;&#x4E4B;&#x4E5D;&#x201D;&#x3002;&#x90A3;&#x9EBC;&#xFF0C;&#x5728;&#x6BD4;&#x7279;&#x5E63;&#x4E2D;&#xFF0C;&#x4F54;&#x6709;&#x662F;&#x6CD5;&#x5F8B;&#x7684;&#x5341;&#x5206;&#x4E4B;&#x4E00;&#x3002;&#x64C1;&#x6709;&#x89E3;&#x9396;&#x6BD4;&#x7279;&#x5E63;&#x7684;&#x5BC6;&#x9470;&#x76F8;&#x7576;&#x65BC;&#x64C1;&#x6709;&#x73FE;&#x91D1;&#x6216;&#x8CB4;&#x91CD;&#x91D1;&#x5C6C;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x6703;&#x5931;&#x53BB;&#x5B83;&#xFF0C;&#x653E;&#x932F;&#x4F4D;&#x7F6E;&#xFF0C;&#x88AB;&#x76DC;&#xFF0C;&#x6216;&#x8005;&#x4E0D;&#x5C0F;&#x5FC3;&#x628A;&#x932F;&#x8AA4;&#x7684;&#x6578;&#x5B57;&#x7D66;&#x5225;&#x4EBA;&#x3002;&#x5728;&#x6BCF;&#x4E00;&#x7A2E;&#x60C5;&#x6CC1;&#x4E0B;&#xFF0C;&#x7528;&#x6236;&#x90FD;&#x6C92;&#x6709;&#x8FFD;&#x7D22;&#x6B0A;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x4ED6;&#x5011;&#x5728;&#x516C;&#x5171;&#x4EBA;&#x884C;&#x9053;&#x4E0A;&#x653E;&#x68C4;&#x4E86;&#x73FE;&#x91D1;&#x4E00;&#x6A23;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x4F46;&#x662F;&#xFF0C;&#x6BD4;&#x7279;&#x5E63;&#x5177;&#x6709;&#x73FE;&#x91D1;&#xFF0C;&#x9EC3;&#x91D1;&#x548C;&#x9280;&#x884C;&#x8CEC;&#x6236;&#x4E0D;&#x5177;&#x5099;&#x7684;&#x80FD;&#x529B;&#x3002;&#x5305;&#x542B;&#x60A8;&#x7684;&#x5BC6;&#x9470;&#x7684;&#x6BD4;&#x7279;&#x5E63;&#x9322;&#x5305;&#x53EF;&#x4EE5;&#x50CF;&#x4EFB;&#x4F55;&#x6A94;&#x6848;&#x4E00;&#x6A23;&#x5099;&#x4EFD;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x5132;&#x5B58;&#x5728;&#x591A;&#x500B;&#x526F;&#x672C;&#x4E2D;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x6253;&#x5370;&#x5728;&#x7D19;&#x5F35;&#x4E0A;&#x9032;&#x884C;&#x786C;&#x62F7;&#x8C9D;&#x5099;&#x4EFD;&#x3002;&#x60A8;&#x4E0D;&#x80FD;&#x201C;&#x5099;&#x4EFD;&#x201D;&#x73FE;&#x91D1;&#xFF0C;&#x9EC3;&#x91D1;&#x6216;&#x9280;&#x884C;&#x8CEC;&#x6236;&#x3002;&#x6BD4;&#x7279;&#x5E63;&#x8207;&#x4E4B;&#x524D;&#x7684;&#x4EFB;&#x4F55;&#x6771;&#x897F;&#x90FD;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x6211;&#x5011;&#x9700;&#x8981;&#x4EE5;&#x4E00;&#x7A2E;&#x65B0;&#x7A4E;&#x7684;&#x65B9;&#x5F0F;&#x4F86;&#x601D;&#x8003;&#x6BD4;&#x7279;&#x5E63;&#x5B89;&#x5168;&#x3002;</p>
</div>
<div class="sect2">
<h3 id="__">&#x5B89;&#x5168;&#x539F;&#x5247;</h3>
<div class="paragraph">
<p>&#x6BD4;&#x7279;&#x5E63;&#x7684;&#x6838;&#x5FC3;&#x539F;&#x5247;&#x662F;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#xFF0C;&#x5B83;&#x5C0D;&#x5B89;&#x5168;&#x6027;&#x6709;&#x91CD;&#x8981;&#x5F71;&#x97FF;&#x3002;&#x50B3;&#x7D71;&#x7684;&#x9280;&#x884C;&#x6216;&#x652F;&#x4ED8;&#x7DB2;&#x8DEF;&#x7B49;&#x96C6;&#x4E2D;&#x6A21;&#x5F0F;&#x4F9D;&#x8CF4;&#x65BC;&#x8A2A;&#x554F;&#x63A7;&#x5236;&#x548C;&#x5BE9;&#x67E5;&#xFF0C;&#x4EE5;&#x9632;&#x6B62;&#x4E0D;&#x826F;&#x884C;&#x70BA;&#x8005;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x50CF;&#x6BD4;&#x7279;&#x5E63;&#x9019;&#x6A23;&#x7684;&#x5206;&#x6563;&#x7CFB;&#x7D71;&#x5C07;&#x8CAC;&#x4EFB;&#x548C;&#x63A7;&#x5236;&#x4EA4;&#x7D66;&#x4E86;&#x7528;&#x6236;&#x3002;&#x7531;&#x65BC;&#x7DB2;&#x8DEF;&#x7684;&#x5B89;&#x5168;&#x6027;&#x57FA;&#x65BC;&#x5DE5;&#x4F5C;&#x91CF;&#x8B49;&#x660E;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8A2A;&#x554F;&#x63A7;&#x5236;&#xFF0C;&#x56E0;&#x6B64;&#x7DB2;&#x8DEF;&#x53EF;&#x4EE5;&#x516C;&#x958B;&#xFF0C;&#x4E26;&#x4E14;&#x6BD4;&#x7279;&#x5E63;&#x6D41;&#x91CF;&#x4E0D;&#x9700;&#x8981;&#x52A0;&#x5BC6;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x5728;&#x8AF8;&#x5982;&#x4FE1;&#x7528;&#x5361;&#x7CFB;&#x7D71;&#x7684;&#x50B3;&#x7D71;&#x652F;&#x4ED8;&#x7DB2;&#x8DEF;&#x4E2D;&#xFF0C;&#x652F;&#x4ED8;&#x662F;&#x958B;&#x653E;&#x5F0F;&#x7684;&#xFF0C;&#x56E0;&#x70BA;&#x5B83;&#x5305;&#x542B;&#x7528;&#x6236;&#x7684;&#x79C1;&#x4EBA;&#x6A19;&#x8B58;&#x7B26;&#xFF08;&#x4FE1;&#x7528;&#x5361;&#x865F;&#x78BC;&#xFF09;&#x3002;&#x5728;&#x521D;&#x59CB;&#x6536;&#x8CBB;&#x5F8C;&#xFF0C;&#x4EFB;&#x4F55;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8A72;&#x6A19;&#x8B58;&#x7B26;&#x7684;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x201C;&#x62C9;&#x53D6;&#x201D;&#x8CC7;&#x91D1;&#x4E26;&#x4E00;&#x6B21;&#x53C8;&#x4E00;&#x6B21;&#x5730;&#x5411;&#x64C1;&#x6709;&#x8005;&#x6536;&#x8CBB;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x652F;&#x4ED8;&#x7DB2;&#x8DEF;&#x5FC5;&#x9808;&#x901A;&#x904E;&#x52A0;&#x5BC6;&#x9032;&#x884C;&#x7AEF;&#x5C0D;&#x7AEF;&#x7684;&#x5B89;&#x5168;&#x4FDD;&#x8B77;&#xFF0C;&#x5FC5;&#x9808;&#x78BA;&#x4FDD;&#x6C92;&#x6709;&#x7ACA;&#x807D;&#x8005;&#x6216;&#x4E2D;&#x9593;&#x4EBA;&#x53EF;&#x4EE5;&#x5371;&#x5BB3;&#x4ED8;&#x6B3E;&#x6D41;&#x91CF;&#xFF0C;&#x5305;&#x62EC;&#x50B3;&#x8F38;&#x4E2D;&#x6216;&#x5132;&#x5B58;&#x6642;&#xFF08;&#x975C;&#x6B62;&#x6642;&#xFF09;&#x3002;&#x5982;&#x679C;&#x4E00;&#x500B;&#x4E0D;&#x826F;&#x884C;&#x70BA;&#x8005;&#x7372;&#x5F97;&#x4E86;&#x8A2A;&#x554F;&#x7CFB;&#x7D71;&#x7684;&#x6B0A;&#x9650;&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x5371;&#x5BB3;&#x7576;&#x524D;&#x7684;&#x4EA4;&#x6613;&#xFF0C;<em>&#x4EE5;&#x53CA;</em> &#x53EF;&#x7528;&#x65BC;&#x5275;&#x5EFA;&#x65B0;&#x4EA4;&#x6613;&#x7684;&#x652F;&#x4ED8;&#x4EE4;&#x724C;&#x3002;&#x66F4;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#xFF0C;&#x7576;&#x5BA2;&#x6236;&#x6578;&#x64DA;&#x906D;&#x5230;&#x7834;&#x58DE;&#x6642;&#xFF0C;&#x5BA2;&#x6236;&#x9762;&#x81E8;&#x8EAB;&#x4EFD;&#x76DC;&#x7528;&#x7684;&#x98A8;&#x96AA;&#xFF0C;&#x5FC5;&#x9808;&#x63A1;&#x53D6;&#x63AA;&#x65BD;&#x9632;&#x6B62;&#x88AB;&#x76DC;&#x8CEC;&#x6236;&#x7684;&#x6B3A;&#x8A50;&#x6027;&#x4F7F;&#x7528;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x6BD4;&#x7279;&#x5E63;&#x6709;&#x5F88;&#x5927;&#x7684;&#x4E0D;&#x540C;&#x3002;&#x6BD4;&#x7279;&#x5E63;&#x4EA4;&#x6613;&#x50C5;&#x5411;&#x7279;&#x5B9A;&#x6536;&#x4EF6;&#x4EBA;&#x6388;&#x4E88;&#x7279;&#x5B9A;&#x7684;&#x50F9;&#x503C;&#xFF0C;&#x4E0D;&#x80FD;&#x507D;&#x9020;&#x6216;&#x4FEE;&#x6539;&#x3002;&#x5B83;&#x4E0D;&#x6703;&#x900F;&#x9732;&#x4EFB;&#x4F55;&#x96B1;&#x79C1;&#x8A0A;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#x7576;&#x4E8B;&#x4EBA;&#x7684;&#x8EAB;&#x4EFD;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x7528;&#x65BC;&#x6388;&#x6B0A;&#x984D;&#x5916;&#x4ED8;&#x6B3E;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6BD4;&#x7279;&#x5E63;&#x652F;&#x4ED8;&#x7DB2;&#x8DEF;&#x4E0D;&#x9700;&#x8981;&#x52A0;&#x5BC6;&#x6216;&#x9632;&#x6B62;&#x7ACA;&#x807D;&#x3002;&#x4E8B;&#x5BE6;&#x4E0A;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x901A;&#x904E;&#x958B;&#x653E;&#x7684;&#x516C;&#x5171;&#x983B;&#x9053;&#xFF08;&#x4F8B;&#x5982;&#x4E0D;&#x5B89;&#x5168;&#x7684;WiFi&#x6216;&#x85CD;&#x7259;&#xFF09;&#x4F86;&#x5EE3;&#x64AD;&#x6BD4;&#x7279;&#x5E63;&#x4EA4;&#x6613;&#xFF0C;&#x540C;&#x6642;&#x4E0D;&#x6703;&#x964D;&#x4F4E;&#x5B89;&#x5168;&#x6027;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x6BD4;&#x7279;&#x5E63;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5B89;&#x5168;&#x6A21;&#x5F0F;&#x5C07;&#x5927;&#x91CF;&#x6B0A;&#x529B;&#x4EA4;&#x7D66;&#x7528;&#x6236;&#x3002;&#x6709;&#x4E86;&#x9019;&#x500B;&#x6B0A;&#x529B;&#x5C31;&#x6709;&#x8CAC;&#x4EFB;&#x5C0D;&#x5BC6;&#x9470;&#x9032;&#x884C;&#x4FDD;&#x5BC6;&#x3002;&#x5C0D;&#x65BC;&#x5927;&#x591A;&#x6578;&#x7528;&#x6236;&#x4F86;&#x8AAA;&#xFF0C;&#x9019;&#x4E26;&#x4E0D;&#x5BB9;&#x6613;&#xFF0C;&#x7279;&#x5225;&#x662F;&#x5728;&#x901A;&#x7528;&#x8A08;&#x7B97;&#x8A2D;&#x5099;&#x4E0A;&#xFF0C;&#x4F8B;&#x5982;&#x9023;&#x63A5;&#x4E92;&#x806F;&#x7DB2;&#x7684;&#x667A;&#x80FD;&#x624B;&#x6A5F;&#x6216;&#x7B46;&#x8A18;&#x672C;&#x96FB;&#x8166;&#x3002;&#x96D6;&#x7136;&#x6BD4;&#x7279;&#x5E63;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x5411;&#x4FE1;&#x7528;&#x5361;&#x90A3;&#x6A23;&#x51FA;&#x73FE;&#x5927;&#x898F;&#x6A21;&#x5371;&#x6A5F;&#xFF0C;&#x4F46;&#x8A31;&#x591A;&#x7528;&#x6236;&#x7121;&#x6CD5;&#x5145;&#x5206;&#x4FDD;&#x8B77;&#x4ED6;&#x5011;&#x7684;&#x5BC6;&#x9470;&#xFF0C;&#x4E26;&#x4E00;&#x500B;&#x63A5;&#x4E00;&#x500B;&#x5730;&#x88AB;&#x9ED1;&#x5BA2;&#x5165;&#x4FB5;&#x3002;</p>
</div>
<div class="sect3">
<h4 id="___2">&#x5B89;&#x5168;&#x5730;&#x958B;&#x767C;&#x6BD4;&#x7279;&#x5E63;&#x7CFB;&#x7D71;</h4>
<div class="paragraph">
<p>&#x6BD4;&#x7279;&#x5E63;&#x958B;&#x767C;&#x8005;&#x6700;&#x91CD;&#x8981;&#x7684;&#x539F;&#x5247;&#x662F;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x3002;&#x5927;&#x591A;&#x6578;&#x958B;&#x767C;&#x4EBA;&#x54E1;&#x90FD;&#x719F;&#x6089;&#x96C6;&#x4E2D;&#x5F0F;&#x5B89;&#x5168;&#x6A21;&#x578B;&#xFF0C;&#x4E26;&#x53EF;&#x80FD;&#x8A66;&#x5716;&#x5C07;&#x9019;&#x4E9B;&#x6A21;&#x578B;&#x61C9;&#x7528;&#x5230;&#x4ED6;&#x5011;&#x7684;&#x6BD4;&#x7279;&#x5E63;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x4E2D;&#xFF0C;&#x5F9E;&#x800C;&#x5E36;&#x4F86;&#x707D;&#x96E3;&#x6027;&#x5F8C;&#x679C;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x6BD4;&#x7279;&#x5E63;&#x7684;&#x5B89;&#x5168;&#x6027;&#x4F9D;&#x8CF4;&#x65BC;&#x5C0D;&#x5BC6;&#x9470;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x63A7;&#x5236;&#x4EE5;&#x53CA;&#x7926;&#x5DE5;&#x7684;&#x7368;&#x7ACB;&#x4EA4;&#x6613;&#x9A57;&#x8B49;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x5229;&#x7528;&#x6BD4;&#x7279;&#x5E63;&#x7684;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x78BA;&#x4FDD;&#x4F60;&#x4FDD;&#x6301;&#x5728;&#x6BD4;&#x7279;&#x5E63;&#x5B89;&#x5168;&#x6A21;&#x578B;&#x4E2D;&#x3002;&#x7C21;&#x800C;&#x8A00;&#x4E4B;&#xFF1A;&#x4E0D;&#x8981;&#x5C07;&#x5BC6;&#x9470;&#x5F9E;&#x7528;&#x6236;&#x624B;&#x4E2D;&#x63A5;&#x7BA1;&#xFF0C;&#x4E5F;&#x4E0D;&#x8981;&#x5C07;&#x4EA4;&#x6613;&#x5F9E;&#x5340;&#x584A;&#x93C8;&#x4E2D;&#x79FB;&#x9664;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x4F8B;&#x5982;&#xFF0C;&#x8A31;&#x591A;&#x65E9;&#x671F;&#x7684;&#x6BD4;&#x7279;&#x5E63;&#x4EA4;&#x6613;&#x6240;&#x5C07;&#x6240;&#x6709;&#x7528;&#x6236;&#x8CC7;&#x91D1;&#x96C6;&#x4E2D;&#x5728;&#x55AE;&#x500B;&#x201C;&#x71B1;&#x201D;&#x9322;&#x5305;&#x4E2D;&#xFF0C;&#x5BC6;&#x9470;&#x5132;&#x5B58;&#x5728;&#x55AE;&#x500B;&#x4F3A;&#x670D;&#x5668;&#x4E0A;&#x3002;&#x9019;&#x7A2E;&#x8A2D;&#x8A08;&#x6D88;&#x9664;&#x4E86;&#x7528;&#x6236;&#x7684;&#x63A7;&#x5236;&#x6B0A;&#xFF0C;&#x4E26;&#x96C6;&#x4E2D;&#x63A7;&#x5236;&#x55AE;&#x500B;&#x7CFB;&#x7D71;&#x4E2D;&#x7684;&#x5BC6;&#x9470;&#x3002;&#x8A31;&#x591A;&#x6B64;&#x985E;&#x7CFB;&#x7D71;&#x5DF2;&#x88AB;&#x9ED1;&#x5BA2;&#x5165;&#x4FB5;&#xFF0C;&#x5C0D;&#x5BA2;&#x6236;&#x9020;&#x6210;&#x707D;&#x96E3;&#x6027;&#x5F8C;&#x679C;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x53E6;&#x4E00;&#x500B;&#x5E38;&#x898B;&#x7684;&#x932F;&#x8AA4;&#x662F;&#xFF0C;&#x70BA;&#x4E86;&#x6E1B;&#x5C11;&#x4EA4;&#x6613;&#x8CBB;&#x7528;&#x6216;&#x52A0;&#x901F;&#x4EA4;&#x6613;&#x8655;&#x7406;&#xFF0C;&#x932F;&#x8AA4;&#x5730;&#x5C07;&#x4EA4;&#x6613;&#x201C;&#x812B;&#x96E2;&#x5340;&#x584A;&#x93C8;&#x201D;&#x3002;&#x4E00;&#x500B;&#x201C;&#x96E2;&#x7DDA;&#x7684;&#x5340;&#x584A;&#x93C8;&#x201D;&#x7CFB;&#x7D71;&#x5C07;&#x5728;&#x5167;&#x90E8;&#x7684;&#x96C6;&#x4E2D;&#x5F0F;&#x8CEC;&#x672C;&#x4E0A;&#x8A18;&#x9304;&#x4EA4;&#x6613;&#xFF0C;&#x4E26;&#x4E14;&#x5076;&#x723E;&#x5C07;&#x5B83;&#x5011;&#x540C;&#x6B65;&#x5230;&#x6BD4;&#x7279;&#x5E63;&#x5340;&#x584A;&#x93C8;&#x4E0A;&#x3002;&#x9019;&#x7A2E;&#x505A;&#x6CD5;&#x518D;&#x6B21;&#x4EE5;&#x5C08;&#x6709;&#x548C;&#x96C6;&#x4E2D;&#x7684;&#x65B9;&#x5F0F;&#x53D6;&#x4EE3;&#x4E86;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x6BD4;&#x7279;&#x5E63;&#x5B89;&#x5168;&#x6027;&#x3002;&#x7576;&#x4EA4;&#x6613;&#x96E2;&#x958B;&#x5340;&#x584A;&#x93C8;&#x6642;&#xFF0C;&#x5B89;&#x5168;&#x63AA;&#x65BD;&#x4E0D;&#x7576;&#x7684;&#x96C6;&#x4E2D;&#x8CEC;&#x672C;&#x53EF;&#x80FD;&#x88AB;&#x507D;&#x9020;&#xFF0C;&#x5C0E;&#x81F4;&#x8CC7;&#x91D1;&#x6D41;&#x5931;&#x548C;&#x5132;&#x5099;&#x67AF;&#x7AED;&#xFF0C;&#x800C;&#x4E0D;&#x88AB;&#x4EBA;&#x6CE8;&#x610F;&#x5230;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x9664;&#x975E;&#x60A8;&#x6E96;&#x5099;&#x5728;&#x904B;&#x71DF;&#x5B89;&#x5168;&#xFF0C;&#x591A;&#x5C64;&#x8A2A;&#x554F;&#x63A7;&#x5236;&#x548C;&#x5BE9;&#x8A08;&#xFF08;&#x5982;&#x50B3;&#x7D71;&#x9280;&#x884C;&#x6240;&#x505A;&#x7684;&#x90A3;&#x6A23;&#xFF09;&#x4E0A;&#x6295;&#x5165;&#x5927;&#x91CF;&#x8CC7;&#x91D1;&#xFF0C;&#x5426;&#x5247;&#x5728;&#x5C07;&#x8CC7;&#x91D1;&#x7528;&#x65BC;&#x6BD4;&#x7279;&#x5E63;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x74B0;&#x5883;&#x5916;&#x4E4B;&#x524D;&#xFF0C;&#x61C9;&#x8A72;&#x4ED4;&#x7D30;&#x8003;&#x616E;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x6709;&#x8DB3;&#x5920;&#x7684;&#x8CC7;&#x91D1;&#x548C;&#x898F;&#x5247;&#x4F86;&#x5BE6;&#x65BD;&#x5F37;&#x5927;&#x7684;&#x5B89;&#x5168;&#x6A21;&#x5F0F;&#xFF0C;&#x9019;&#x6A23;&#x7684;&#x8A2D;&#x8A08;&#x4E5F;&#x53EA;&#x662F;&#x8907;&#x88FD;&#x4E86;&#x50B3;&#x7D71;&#x91D1;&#x878D;&#x7DB2;&#x8DEF;&#x7684;&#x8106;&#x5F31;&#x6A21;&#x5F0F;&#xFF0C;&#x9019;&#x7A2E;&#x6A21;&#x5F0F;&#x53D7;&#x5230;&#x8EAB;&#x4EFD;&#x76DC;&#x7528;&#xFF0C;&#x8150;&#x6557;&#x548C;&#x8CAA;&#x6C59;&#x7684;&#x56F0;&#x64FE;&#x3002;&#x70BA;&#x4E86;&#x5229;&#x7528;&#x6BD4;&#x7279;&#x5E63;&#x7368;&#x7279;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5B89;&#x5168;&#x6A21;&#x5F0F;&#xFF0C;&#x60A8;&#x5FC5;&#x9808;&#x907F;&#x514D;&#x53EF;&#x80FD;&#x6703;&#x611F;&#x5230;&#x719F;&#x6089;&#x4F46;&#x6700;&#x7D42;&#x985B;&#x8986;&#x6BD4;&#x7279;&#x5E63;&#x5B89;&#x5168;&#x6027;&#x7684;&#x96C6;&#x4E2D;&#x5F0F;&#x9AD4;&#x7CFB;&#x7D50;&#x69CB;&#x7684;&#x8A98;&#x60D1;&#x3002;</p>
</div>
</div>
<div class="sect3">
<h4 id="__root_of_trust">&#x4FE1;&#x4EFB;&#x6839; Root of Trust</h4>
<div class="paragraph">
<p>&#x50B3;&#x7D71;&#x7684;&#x5B89;&#x5168;&#x9AD4;&#x7CFB;&#x7D50;&#x69CB;&#x57FA;&#x65BC;&#x4E00;&#x500B;&#x7A31;&#x70BA; <em>&#x4FE1;&#x4EFB;&#x6839;</em> <em>root of trust</em> &#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x500B;&#x53EF;&#x4FE1;&#x7684;&#x6838;&#x5FC3;&#xFF0C;&#x7528;&#x4F5C;&#x6574;&#x500B;&#x7CFB;&#x7D71;&#x6216;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x5B89;&#x5168;&#x7684;&#x57FA;&#x790E;&#x3002;&#x5B89;&#x5168;&#x67B6;&#x69CB;&#x662F;&#x570D;&#x7E5E;&#x4FE1;&#x4EFB;&#x6839;&#x767C;&#x5C55;&#x8D77;&#x4F86;&#x7684;&#xFF0C;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x540C;&#x5FC3;&#x5713;&#xFF0C;&#x5982;&#x6D0B;&#x8525;&#x4E2D;&#x7684;&#x5C64;&#xFF0C;&#x5F9E;&#x4E2D;&#x5FC3;&#x5411;&#x5916;&#x64F4;&#x5C55;&#x4FE1;&#x4EFB;&#x3002;&#x6BCF;&#x5C64;&#x4F7F;&#x7528;&#x8A2A;&#x554F;&#x63A7;&#x5236;&#xFF0C;&#x6578;&#x5B57;&#x7C3D;&#x540D;&#xFF0C;&#x52A0;&#x5BC6;&#x548C;&#x5176;&#x4ED6;&#x5B89;&#x5168;&#x57FA;&#x5143;&#x69CB;&#x5EFA;&#x66F4;&#x53EF;&#x4FE1;&#x7684;&#x5167;&#x5C64;&#x3002;&#x96A8;&#x8457;&#x8EDF;&#x9AD4;&#x7CFB;&#x7D71;&#x8B8A;&#x5F97;&#x8D8A;&#x4F86;&#x8D8A;&#x8907;&#x96DC;&#xFF0C;&#x5B83;&#x5011;&#x66F4;&#x5BB9;&#x6613;&#x5305;&#x542B;&#x932F;&#x8AA4;&#xFF0C;&#x9019;&#x4F7F;&#x5F97;&#x5B83;&#x5011;&#x5BB9;&#x6613;&#x53D7;&#x5230;&#x5B89;&#x5168;&#x5371;&#x5BB3;&#x3002;&#x7D50;&#x679C;&#xFF0C;&#x8EDF;&#x9AD4;&#x7CFB;&#x7D71;&#x8D8A;&#x8907;&#x96DC;&#xFF0C;&#x5C31;&#x8D8A;&#x96E3;&#x4FDD;&#x8B49;&#x5B89;&#x5168;&#x3002;&#x4FE1;&#x4EFB;&#x6839;&#x7684;&#x6982;&#x5FF5;&#x53EF;&#x4EE5;&#x78BA;&#x4FDD;&#x5927;&#x591A;&#x6578;&#x4FE1;&#x4EFB;&#x88AB;&#x653E;&#x7F6E;&#x5728;&#x7CFB;&#x7D71;&#x4E2D;&#x6700;&#x4E0D;&#x5FA9;&#x96DC;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x7CFB;&#x7D71;&#x4E2D;&#x6700;&#x4E0D;&#x6613;&#x53D7;&#x5F71;&#x97FF;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x66F4;&#x5FA9;&#x96DC;&#x7684;&#x8EDF;&#x9AD4;&#x5247;&#x570D;&#x7E5E;&#x8457;&#x5B83;&#x3002;&#x9019;&#x7A2E;&#x5B89;&#x5168;&#x9AD4;&#x7CFB;&#x7D50;&#x69CB;&#x5728;&#x4E0D;&#x540C;&#x898F;&#x6A21;&#x4E0A;&#x91CD;&#x8907;&#x51FA;&#x73FE;&#xFF0C;&#x9996;&#x5148;&#x5728;&#x55AE;&#x500B;&#x7CFB;&#x7D71;&#x7684;&#x786C;&#x9AD4;&#x4E2D;&#x5EFA;&#x7ACB;&#x4FE1;&#x4EFB;&#x6839;&#xFF0C;&#x7136;&#x5F8C;&#x901A;&#x904E;&#x64CD;&#x4F5C;&#x7CFB;&#x7D71;&#x5C07;&#x4FE1;&#x4EFB;&#x6839;&#x64F4;&#x5C55;&#x5230;&#x66F4;&#x9AD8;&#x7D1A;&#x7684;&#x7CFB;&#x7D71;&#x670D;&#x52D9;&#xFF0C;&#x6700;&#x5F8C;&#x8DE8;&#x8D8A;&#x591A;&#x500B;&#x4F3A;&#x670D;&#x5668;&#x6E1B;&#x5C11;&#x4FE1;&#x4EFB;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x6BD4;&#x7279;&#x5E63;&#x5B89;&#x5168;&#x67B6;&#x69CB;&#x4E0D;&#x540C;&#x3002;&#x5728;&#x6BD4;&#x7279;&#x5E63;&#x4E2D;&#xFF0C;&#x5171;&#x8B58;&#x7CFB;&#x7D71;&#x5275;&#x5EFA;&#x4E86;&#x4E00;&#x500B;&#x5B8C;&#x5168;&#x5206;&#x6563;&#x7684;&#x53EF;&#x4FE1;&#x516C;&#x5171;&#x8CEC;&#x672C;&#x3002;&#x7D93;&#x904E;&#x6B63;&#x78BA;&#x9A57;&#x8B49;&#x7684;&#x5340;&#x584A;&#x93C8;&#x4F7F;&#x7528;&#x5275;&#x4E16;&#x5340;&#x584A;&#x4F5C;&#x70BA;&#x4FE1;&#x4EFB;&#x6839;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E00;&#x500B;&#x76F4;&#x81F3;&#x7576;&#x524D;&#x5340;&#x584A;&#x7684;&#x4FE1;&#x4EFB;&#x93C8;&#x3002;&#x6BD4;&#x7279;&#x5E63;&#x7CFB;&#x7D71;&#x53EF;&#x4EE5;&#x4E5F;&#x61C9;&#x8A72;&#x4F7F;&#x7528;&#x5340;&#x584A;&#x93C8;&#x4F5C;&#x70BA;&#x4ED6;&#x5011;&#x7684;&#x4FE1;&#x4EFB;&#x6839;&#x3002;&#x5728;&#x8A2D;&#x8A08;&#x7531;&#x8A31;&#x591A;&#x4E0D;&#x540C;&#x7CFB;&#x7D71;&#x4E0A;&#x7684;&#x670D;&#x52D9;&#x7D44;&#x6210;&#x7684;&#x8907;&#x96DC;&#x6BD4;&#x7279;&#x5E63;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x6642;&#xFF0C;&#x60A8;&#x61C9;&#x4ED4;&#x7D30;&#x6AA2;&#x67E5;&#x5B89;&#x5168;&#x67B6;&#x69CB;&#xFF0C;&#x4EE5;&#x78BA;&#x5B9A;&#x4FE1;&#x4EFB;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x6700;&#x7D42;&#xFF0C;&#x552F;&#x4E00;&#x61C9;&#x8A72;&#x660E;&#x78BA;&#x4FE1;&#x4EFB;&#x7684;&#x662F;&#x5B8C;&#x5168;&#x9A57;&#x8B49;&#x7684;&#x5340;&#x584A;&#x93C8;&#x3002;&#x5982;&#x679C;&#x60A8;&#x7684;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x660E;&#x78BA;&#x6216;&#x96B1;&#x542B;&#x5730;&#x4FE1;&#x4EFB;&#x9664;&#x5340;&#x584A;&#x93C8;&#x4E4B;&#x5916;&#x7684;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x8A0A;&#x606F;&#xFF0C;&#x90A3;&#x9EBC;&#x61C9;&#x8A72;&#x5F15;&#x8D77;&#x95DC;&#x6CE8;&#xFF0C;&#x56E0;&#x70BA;&#x5B83;&#x6703;&#x5F15;&#x5165;&#x6F0F;&#x6D1E;&#x3002;&#x8A55;&#x4F30;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x7684;&#x5B89;&#x5168;&#x9AD4;&#x7CFB;&#x7D50;&#x69CB;&#x7684;&#x4E00;&#x500B;&#x597D;&#x65B9;&#x6CD5;&#x662F;&#x8003;&#x616E;&#x6BCF;&#x500B;&#x55AE;&#x7368;&#x7684;&#x7D44;&#x4EF6;&#x4E26;&#x8A55;&#x4F30;&#x4E00;&#x500B;&#x5047;&#x60F3;&#x7684;&#x5834;&#x666F;&#xFF0C;&#x5176;&#x4E2D;&#x8A72;&#x7D44;&#x4EF6;&#x5B8C;&#x5168;&#x53D7;&#x5230;&#x653B;&#x64CA;&#x4E26;&#x8655;&#x65BC;&#x60E1;&#x610F;&#x884C;&#x70BA;&#x8005;&#x7684;&#x63A7;&#x5236;&#x4E4B;&#x4E0B;&#x3002;&#x4F9D;&#x6B21;&#x8A55;&#x4F30;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x7684;&#x6BCF;&#x500B;&#x7D44;&#x4EF6;&#x53D7;&#x5230;&#x5371;&#x5BB3;&#x6642;&#x5C0D;&#x6574;&#x9AD4;&#x5B89;&#x5168;&#x6027;&#x7684;&#x5F71;&#x97FF;&#x3002;&#x5982;&#x679C;&#x60A8;&#x7684;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x5728;&#x7D44;&#x4EF6;&#x53D7;&#x640D;&#x6642;&#x4E0D;&#x518D;&#x5B89;&#x5168;&#xFF0C;&#x5247;&#x8868;&#x660E;&#x60A8;&#x932F;&#x8AA4;&#x5730;&#x4FE1;&#x4EFB;&#x9019;&#x4E9B;&#x7D44;&#x4EF6;&#x3002;&#x4E00;&#x500B;&#x6C92;&#x6709;&#x6F0F;&#x6D1E;&#x7684;&#x6BD4;&#x7279;&#x5E63;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x61C9;&#x8A72;&#x53EA;&#x6703;&#x640D;&#x5BB3;&#x6BD4;&#x7279;&#x5E63;&#x5171;&#x8B58;&#x6A5F;&#x5236;&#xFF0C;&#x9019;&#x610F;&#x5473;&#x8457;&#x5B83;&#x7684;&#x4FE1;&#x4EFB;&#x6839;&#x6E90;&#x662F;&#x6BD4;&#x7279;&#x5E63;&#x5B89;&#x5168;&#x67B6;&#x69CB;&#x4E2D;&#x6700;&#x5F37;&#x5927;&#x7684;&#x90E8;&#x5206;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x773E;&#x591A;&#x88AB;&#x9ED1;&#x5BA2;&#x5165;&#x4FB5;&#x7684;&#x6BD4;&#x7279;&#x5E63;&#x4EA4;&#x6613;&#x6240;&#x7684;&#x4F8B;&#x5B50;&#x6709;&#x52A9;&#x65BC;&#x5F37;&#x8ABF;&#x9019;&#x4E00;&#x9EDE;&#xFF0C;&#x56E0;&#x70BA;&#x5373;&#x4F7F;&#x5728;&#x6700;&#x5076;&#x7136;&#x7684;&#x5BE9;&#x67E5;&#x4E0B;&#xFF0C;&#x5176;&#x5B89;&#x5168;&#x67B6;&#x69CB;&#x548C;&#x8A2D;&#x8A08;&#x4E5F;&#x6703;&#x5931;&#x6557;&#x3002;&#x9019;&#x4E9B;&#x96C6;&#x4E2D;&#x5F0F;&#x5BE6;&#x65BD;&#x5DF2;&#x7D93;&#x5C07;&#x4FE1;&#x4EFB;&#x660E;&#x78BA;&#x5730;&#x6295;&#x5165;&#x5230;&#x6BD4;&#x7279;&#x5E63;&#x5340;&#x584A;&#x93C8;&#x4EE5;&#x5916;&#x7684;&#x773E;&#x591A;&#x7D44;&#x4EF6;&#x4E2D;&#xFF0C;&#x6BD4;&#x5982;&#x71B1;&#x9322;&#x5305;&#xFF0C;&#x96C6;&#x4E2D;&#x5316;&#x8CEC;&#x672C;&#x8CC7;&#x6599;&#x5EAB;&#xFF0C;&#x6613;&#x53D7;&#x653B;&#x64CA;&#x7684;&#x52A0;&#x5BC6;&#x5BC6;&#x9470;&#x4EE5;&#x53CA;&#x985E;&#x4F3C;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
</div>
</div>
</div>
<div class="sect2">
<h3 id="___3">&#x7528;&#x6236;&#x5B89;&#x5168;&#x6700;&#x4F73;&#x5BE6;&#x8E10;</h3>
<div class="paragraph">
<p>&#x4EBA;&#x985E;&#x5DF2;&#x7D93;&#x4F7F;&#x7528;&#x4E86;&#x6578;&#x5343;&#x5E74;&#x7684;&#x7269;&#x7406;&#x5B89;&#x5168;&#x63A7;&#x5236;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x6211;&#x5011;&#x5728;&#x6578;&#x5B57;&#x5B89;&#x5168;&#x65B9;&#x9762;&#x7684;&#x7D93;&#x9A57;&#x9084;&#x4E0D;&#x5230;50&#x5E74;&#x3002;&#x73FE;&#x4EE3;&#x901A;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7D71;&#x4E26;&#x4E0D;&#x662F;&#x975E;&#x5E38;&#x5B89;&#x5168;&#xFF0C;&#x4E26;&#x4E0D;&#x9069;&#x5408;&#x5132;&#x5B58;&#x6578;&#x5B57;&#x8CA8;&#x5E63;&#x3002;&#x6211;&#x5011;&#x7684;&#x96FB;&#x8166;&#x901A;&#x904E;&#x6C38;&#x9060;&#x5728;&#x7DDA;&#x7684;&#x4E92;&#x806F;&#x7DB2;&#x9023;&#x63A5;&#x4E0D;&#x65B7;&#x66B4;&#x9732;&#x65BC;&#x5916;&#x90E8;&#x5A01;&#x8105;&#x4E0B;&#x3002;&#x4ED6;&#x5011;&#x904B;&#x884C;&#x6578;&#x767E;&#x500B;&#x4F5C;&#x8005;&#x7684;&#x6578;&#x5343;&#x500B;&#x8EDF;&#x9AD4;&#x7D44;&#x4EF6;&#xFF0C;&#x901A;&#x5E38;&#x7121;&#x9650;&#x5236;&#x5730;&#x8A2A;&#x554F;&#x7528;&#x6236;&#x7684;&#x6A94;&#x6848;&#x3002;&#x5728;&#x60A8;&#x7684;&#x96FB;&#x8166;&#x4E0A;&#x5B89;&#x88DD;&#x7684;&#x6578;&#x5343;&#x500B;&#x8EDF;&#x9AD4;&#x4E2D;&#xFF0C;&#x4E00;&#x500B;&#x6D41;&#x6C13;&#x8EDF;&#x9AD4;&#xFF0C;&#x53EF;&#x80FD;&#x6703;&#x5371;&#x53CA;&#x60A8;&#x7684;&#x9375;&#x76E4;&#x548C;&#x6A94;&#x6848;&#xFF0C;&#x7ACA;&#x53D6;&#x5132;&#x5B58;&#x5728;&#x9322;&#x5305;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x6BD4;&#x7279;&#x5E63;&#x3002;&#x4FDD;&#x6301;&#x96FB;&#x8166;&#x7121;&#x75C5;&#x6BD2;&#x548C;&#x7121;&#x6728;&#x99AC;&#x6240;&#x9700;&#x7684;&#x96FB;&#x8166;&#x7DAD;&#x8B77;&#x6280;&#x80FD;&#x8D85;&#x51FA;&#x4E86;&#x5927;&#x591A;&#x6578;&#x96FB;&#x8166;&#x7528;&#x6236;&#x7684;&#x6C34;&#x5E73;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x5118;&#x7BA1;&#x6709;&#x6578;&#x5341;&#x5E74;&#x4F86;&#x8A0A;&#x606F;&#x5B89;&#x5168;&#x65B9;&#x9762;&#x7684;&#x7814;&#x7A76;&#x548C;&#x9032;&#x6B65;&#xFF0C;&#x4F46;&#x6578;&#x5B57;&#x8CC7;&#x7522;&#x4ECD;&#x7136;&#x5F88;&#x5BB9;&#x6613;&#x53D7;&#x5230;&#x5805;&#x5B9A;&#x7684;&#x5C0D;&#x624B;&#x7684;&#x653B;&#x64CA;&#x3002;&#x5373;&#x4F7F;&#x662F;&#x5728;&#x91D1;&#x878D;&#x670D;&#x52D9;&#x516C;&#x53F8;&#xFF0C;&#x60C5;&#x5831;&#x6A5F;&#x69CB;&#x548C;&#x570B;&#x9632;&#x627F;&#x5305;&#x5546;&#x4E2D;&#x53D7;&#x5230;&#x9AD8;&#x5EA6;&#x4FDD;&#x8B77;&#x548C;&#x9650;&#x5236;&#x7684;&#x7CFB;&#x7D71;&#x4E5F;&#x7D93;&#x5E38;&#x906D;&#x5230;&#x4FB5;&#x72AF;&#x3002;&#x6BD4;&#x7279;&#x5E63;&#x5275;&#x9020;&#x7684;&#x6578;&#x5B57;&#x8CC7;&#x7522;&#x5177;&#x6709;&#x5167;&#x5728;&#x50F9;&#x503C;&#xFF0C;&#x53EF;&#x4EE5;&#x88AB;&#x76DC;&#x53D6;&#xFF0C;&#x4E26;&#x7ACB;&#x5373;&#x4E0D;&#x53EF;&#x64A4;&#x92B7;&#x5730;&#x8F49;&#x79FB;&#x7D66;&#x65B0;&#x7684;&#x6240;&#x6709;&#x8005;&#x3002;&#x9019;&#x70BA;&#x9ED1;&#x5BA2;&#x5275;&#x9020;&#x4E86;&#x4E00;&#x500B;&#x5DE8;&#x5927;&#x7684;&#x8A98;&#x56E0;&#x3002;&#x5230;&#x76EE;&#x524D;&#x70BA;&#x6B62;&#xFF0C;&#x9ED1;&#x5BA2;&#x5728;&#x5165;&#x4FB5;&#x4E4B;&#x5F8C;&#x4E0D;&#x5F97;&#x4E0D;&#x5C07;&#x8EAB;&#x4EFD;&#x8A0A;&#x606F;&#x6216;&#x8CEC;&#x6236;&#x4EE4;&#x724C;&#xFF08;&#x5982;&#x4FE1;&#x7528;&#x5361;&#x548C;&#x9280;&#x884C;&#x8CEC;&#x6236;&#xFF09;&#x8F49;&#x63DB;&#x70BA;&#x50F9;&#x503C;&#x3002;&#x5118;&#x7BA1;&#x92B7;&#x8D13;&#x548C;&#x6D17;&#x9322;&#x5F88;&#x56F0;&#x96E3;&#xFF0C;&#x4F46;&#x6211;&#x5011;&#x767C;&#x73FE;&#x76DC;&#x7ACA;&#x6848;&#x65E5;&#x76CA;&#x589E;&#x591A;&#x3002;&#x6BD4;&#x7279;&#x5E63;&#x5347;&#x7D1A;&#x4E86;&#x9019;&#x500B;&#x554F;&#x984C;&#xFF0C;&#x56E0;&#x70BA;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x88AB;&#x92B7;&#x8D13;&#x6216;&#x6D17;&#x9322;&#xFF1B;&#x9019;&#x662F;&#x6578;&#x5B57;&#x8CC7;&#x7522;&#x7684;&#x5167;&#x5728;&#x50F9;&#x503C;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x5E78;&#x904B;&#x7684;&#x662F;&#xFF0C;&#x6BD4;&#x7279;&#x5E63;&#x4E5F;&#x5275;&#x9020;&#x4E86;&#x63D0;&#x9AD8;&#x96FB;&#x8166;&#x5B89;&#x5168;&#x6027;&#x7684;&#x52D5;&#x529B;&#x3002;&#x4E4B;&#x524D;&#x96FB;&#x8166;&#x88AB;&#x5165;&#x4FB5;&#x7684;&#x98A8;&#x96AA;&#x662F;&#x6A21;&#x7CCA;&#x548C;&#x9593;&#x63A5;&#x7684;&#xFF0C;&#x6BD4;&#x7279;&#x5E63;&#x4F7F;&#x9019;&#x4E9B;&#x98A8;&#x96AA;&#x8B8A;&#x5F97;&#x6E05;&#x6670;&#x660E;&#x77AD;&#x3002;&#x5728;&#x96FB;&#x8166;&#x4E0A;&#x6301;&#x6709;&#x6BD4;&#x7279;&#x5E63;&#x6709;&#x52A9;&#x65BC;&#x5C07;&#x7528;&#x6236;&#x7684;&#x6CE8;&#x610F;&#x529B;&#x96C6;&#x4E2D;&#x5728;&#x63D0;&#x9AD8;&#x96FB;&#x8166;&#x5B89;&#x5168;&#x6027;&#x7684;&#x9700;&#x6C42;&#x4E0A;&#x3002;&#x4F5C;&#x70BA;&#x6BD4;&#x7279;&#x5E63;&#x548C;&#x5176;&#x4ED6;&#x6578;&#x5B57;&#x8CA8;&#x5E63;&#x7684;&#x6FC0;&#x589E;&#x548C;&#x63A1;&#x7528;&#x7684;&#x76F4;&#x63A5;&#x7D50;&#x679C;&#xFF0C;&#x6211;&#x5011;&#x770B;&#x5230;&#x4E86;&#x9ED1;&#x5BA2;&#x6280;&#x8853;&#x548C;&#x5B89;&#x5168;&#x89E3;&#x6C7A;&#x65B9;&#x6848;&#x7684;&#x5347;&#x7D1A;&#x3002;&#x7C21;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x9ED1;&#x5BA2;&#x73FE;&#x5728;&#x6709;&#x4E86;&#x4E00;&#x500B;&#x975E;&#x5E38;&#x80A5;&#x7F8E;&#x7684;&#x76EE;&#x6A19;&#xFF0C;&#x800C;&#x7528;&#x6236;&#x4E5F;&#x6709;&#x4E86;&#x660E;&#x78BA;&#x7684;&#x52D5;&#x6A5F;&#x4F86;&#x4FDD;&#x8B77;&#x81EA;&#x5DF1;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x5728;&#x904E;&#x53BB;&#x7684;&#x4E09;&#x5E74;&#x4E2D;&#xFF0C;&#x4F5C;&#x70BA;&#x6BD4;&#x7279;&#x5E63;&#x61C9;&#x7528;&#x7684;&#x76F4;&#x63A5;&#x7D50;&#x679C;&#xFF0C;&#x6211;&#x5011;&#x770B;&#x5230;&#x4E86;&#x4EE5;&#x786C;&#x9AD4;&#x52A0;&#x5BC6;&#xFF0C;&#x5BC6;&#x9470;&#x5132;&#x5B58;&#x548C;&#x786C;&#x9AD4;&#x9322;&#x5305;&#xFF0C;&#x591A;&#x91CD;&#x7C3D;&#x540D;&#x6280;&#x8853;&#x4EE5;&#x53CA;&#x6578;&#x5B57;&#x8A17;&#x7BA1;&#x7B49;&#x5F62;&#x5F0F;&#x5728;&#x8A0A;&#x606F;&#x5B89;&#x5168;&#x9818;&#x57DF;&#x7684;&#x5DE8;&#x5927;&#x5275;&#x65B0;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x7AE0;&#x7BC0;&#x4E2D;&#xFF0C;&#x6211;&#x5011;&#x5C07;&#x7814;&#x7A76;&#x5BE6;&#x969B;&#x7528;&#x6236;&#x5B89;&#x5168;&#x7684;&#x5404;&#x7A2E;&#x6700;&#x4F73;&#x5BE6;&#x8E10;&#x3002;</p>
</div>
<div class="sect3">
<h4 id="___4">&#x7269;&#x7406;&#x6BD4;&#x7279;&#x5E63;&#x5132;&#x5B58;</h4>
<div class="paragraph">
<p>&#x8B93;&#x6BD4;&#x7279;&#x5E63;&#x96E2;&#x7DDA;&#x7A31;&#x70BA; <em>cold storage</em> &#xFF0C;&#x5B83;&#x662F;&#x6700;&#x6709;&#x6548;&#x7684;&#x5B89;&#x5168;&#x6280;&#x8853;&#x4E4B;&#x4E00;&#x3002;&#x51B7;&#x5132;&#x5B58;&#x7CFB;&#x7D71;&#x662F;&#x5728;&#x96E2;&#x7DDA;&#x7CFB;&#x7D71;&#xFF08;&#x5F9E;&#x672A;&#x9023;&#x63A5;&#x5230;&#x4E92;&#x806F;&#x7DB2;&#xFF09;&#x4E0A;&#x751F;&#x6210;&#x5BC6;&#x9470;&#x4E26;&#x5728;&#x7D19;&#x4E0A;&#x6216;&#x6578;&#x5B57;&#x5A92;&#x9AD4;&#xFF08;&#x5982;USB&#x8A18;&#x61B6;&#x68D2;&#xFF09;&#x4E0A;&#x96E2;&#x7DDA;&#x5132;&#x5B58;&#x7684;&#x7CFB;&#x7D71;&#x3002;</p>
</div>
</div>
<div class="sect3">
<h4 id="___5">&#x786C;&#x9AD4;&#x9322;&#x5305;</h4>
<div class="paragraph">
<p>&#x5F9E;&#x9577;&#x9060;&#x4F86;&#x770B;&#xFF0C;&#x6BD4;&#x7279;&#x5E63;&#x5B89;&#x5168;&#x8D8A;&#x4F86;&#x8D8A;&#x591A;&#x5730;&#x63A1;&#x53D6;&#x786C;&#x9AD4;&#x9632;&#x7BE1;&#x6539;&#x9322;&#x5305;&#x7684;&#x5F62;&#x5F0F;&#x3002;&#x8207;&#x667A;&#x80FD;&#x624B;&#x6A5F;&#x6216;&#x81FA;&#x5F0F;&#x96FB;&#x8166;&#x4E0D;&#x540C;&#xFF0C;&#x6BD4;&#x7279;&#x5E63;&#x786C;&#x9AD4;&#x9322;&#x5305;&#x53EA;&#x6709;&#x4E00;&#x500B;&#x76EE;&#x7684;&#xFF1A;&#x5B89;&#x5168;&#x5730;&#x6301;&#x6709;&#x6BD4;&#x7279;&#x5E63;&#x3002;&#x6C92;&#x6709;&#x901A;&#x7528;&#x8EDF;&#x9AD4;&#x7684;&#x5371;&#x5BB3;&#x4E26;&#x4E14;&#x63A5;&#x53E3;&#x6709;&#x9650;&#xFF0C;&#x786C;&#x9AD4;&#x9322;&#x5305;&#x53EF;&#x4EE5;&#x70BA;&#x975E;&#x5C08;&#x696D;&#x7528;&#x6236;&#x63D0;&#x4F9B;&#x5E7E;&#x4E4E;&#x842C;&#x7121;&#x4E00;&#x5931;&#x7684;&#x5B89;&#x5168;&#x7D1A;&#x5225;&#x3002;&#x6211;&#x671F;&#x671B;&#x770B;&#x5230;&#x786C;&#x9AD4;&#x9322;&#x5305;&#x6210;&#x70BA;&#x6BD4;&#x7279;&#x5E63;&#x5132;&#x5B58;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x6CD5;&#x3002;&#x6709;&#x95DC;&#x9019;&#x7A2E;&#x786C;&#x9AD4;&#x9322;&#x5305;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x8ACB;&#x53C3;&#x95B1; <a href="https://trezor.io/" target="_blank">Trezor</a>&#x3002;</p>
</div>
</div>
<div class="sect3">
<h4 id="___6">&#x5E73;&#x8861;&#x98A8;&#x96AA;</h4>
<div class="paragraph">
<p>&#x96D6;&#x7136;&#x5927;&#x591A;&#x6578;&#x7528;&#x6236;&#x90FD;&#x5C0D;&#x6BD4;&#x7279;&#x5E63;&#x5931;&#x7ACA;&#x6709;&#x6B63;&#x78BA;&#x7684;&#x64D4;&#x6182;&#xFF0C;&#x4F46;&#x98A8;&#x96AA;&#x66F4;&#x5927;&#x3002;&#x6578;&#x64DA;&#x6A94;&#x6848;&#x4E00;&#x76F4;&#x5728;&#x4E1F;&#x5931;&#x3002;&#x5982;&#x679C;&#x4ED6;&#x5011;&#x5305;&#x542B;&#x6BD4;&#x7279;&#x5E63;&#xFF0C;&#x640D;&#x5931;&#x6703;&#x66F4;&#x52A0;&#x75DB;&#x82E6;&#x3002;&#x70BA;&#x4E86;&#x4FDD;&#x8B49;&#x4ED6;&#x5011;&#x7684;&#x6BD4;&#x7279;&#x5E63;&#x9322;&#x5305;&#x7684;&#x5B89;&#x5168;&#xFF0C;&#x7528;&#x6236;&#x5FC5;&#x9808;&#x975E;&#x5E38;&#x5C0F;&#x5FC3;&#xFF0C;&#x4E0D;&#x8981;&#x592A;&#x904E;&#x5206;&#xFF0C;&#x800C;&#x6700;&#x7D42;&#x6703;&#x5931;&#x53BB;&#x6BD4;&#x7279;&#x5E63;&#x3002;2011&#x5E74;7&#x6708;&#xFF0C;&#x4E00;&#x500B;&#x773E;&#x6240;&#x5468;&#x77E5;&#x7684;&#x6BD4;&#x7279;&#x5E63;&#x610F;&#x8B58;&#x548C;&#x6559;&#x80B2;&#x9805;&#x76EE;&#x640D;&#x5931;&#x4E86;&#x8FD1;7,000&#x6BD4;&#x7279;&#x5E63;&#x3002;&#x70BA;&#x4E86;&#x9632;&#x6B62;&#x76DC;&#x7ACA;&#xFF0C;&#x64C1;&#x6709;&#x8005;&#x5011;&#x5BE6;&#x65BD;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x8907;&#x96DC;&#x7684;&#x52A0;&#x5BC6;&#x5099;&#x4EFD;&#x3002;&#x6700;&#x5F8C;&#xFF0C;&#x4ED6;&#x5011;&#x610F;&#x5916;&#x5730;&#x4E1F;&#x5931;&#x4E86;&#x52A0;&#x5BC6;&#x5BC6;&#x9470;&#xFF0C;&#x4F7F;&#x5F97;&#x5099;&#x4EFD;&#x6BEB;&#x7121;&#x50F9;&#x503C;&#x4E26;&#x4E14;&#x5931;&#x53BB;&#x4E86;&#x4E00;&#x7B46;&#x8CA1;&#x5BCC;&#x3002;&#x5C31;&#x50CF;&#x628A;&#x9322;&#x57CB;&#x5728;&#x6C99;&#x6F20;&#x4E2D;&#x4E00;&#x6A23;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x904E;&#x65BC;&#x4ED4;&#x7D30;&#x5730;&#x4FDD;&#x8B77;&#x4F60;&#x7684;&#x6BD4;&#x7279;&#x5E63;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x7121;&#x6CD5;&#x518D;&#x627E;&#x5230;&#x5B83;&#x3002;</p>
</div>
</div>
<div class="sect3">
<h4 id="___7">&#x5206;&#x6563;&#x98A8;&#x96AA;</h4>
<div class="paragraph">
<p>&#x4F60;&#x6703;&#x628A;&#x4F60;&#x7684;&#x5168;&#x90E8;&#x8CC7;&#x7522;&#x4EE5;&#x73FE;&#x91D1;&#x5F62;&#x5F0F;&#x653E;&#x5165;&#x4F60;&#x7684;&#x9322;&#x5305;&#x55CE;&#xFF1F;&#x5927;&#x591A;&#x6578;&#x4EBA;&#x6703;&#x8A8D;&#x70BA;&#x9B6F;&#x83BD;&#xFF0C;&#x4F46;&#x6BD4;&#x7279;&#x5E63;&#x7528;&#x6236;&#x7D93;&#x5E38;&#x628A;&#x6240;&#x6709;&#x7684;&#x6BD4;&#x7279;&#x5E63;&#x653E;&#x5728;&#x4E00;&#x500B;&#x9322;&#x5305;&#x88E1;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x7528;&#x6236;&#x61C9;&#x8A72;&#x5C07;&#x98A8;&#x96AA;&#x5206;&#x6563;&#x5230;&#x591A;&#x7A2E;&#x591A;&#x6A23;&#x7684;&#x6BD4;&#x7279;&#x5E63;&#x9322;&#x5305;&#x4E2D;&#x3002;&#x8B39;&#x614E;&#x7684;&#x7528;&#x6236;&#x5C07;&#x6BD4;&#x7279;&#x5E63;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#xFF0C;&#x6216;&#x8A31;&#x4E0D;&#x5230;5&#xFF05;&#x7684;&#x6BD4;&#x7279;&#x5E63;&#x4FDD;&#x7559;&#x5728;&#x5728;&#x7DDA;&#x6216;&#x79FB;&#x52D5;&#x9322;&#x5305;&#x4E2D;&#x4F5C;&#x70BA;&#x201C;&#x96F6;&#x9322;&#x201D;&#x3002;&#x5269;&#x4E0B;&#x7684;&#x61C9;&#x8A72;&#x5206;&#x6210;&#x5E7E;&#x7A2E;&#x4E0D;&#x540C;&#x7684;&#x6A5F;&#x5236;&#x5132;&#x5B58;&#xFF0C;&#x6BD4;&#x5982;&#x684C;&#x9762;&#x9322;&#x5305;&#x548C;&#x96E2;&#x7DDA;&#xFF08;&#x51B7;&#x5132;&#x5B58;&#xFF09;&#x3002;</p>
</div>
</div>
<div class="sect3">
<h4 id="___8">&#x591A;&#x91CD;&#x7C3D;&#x540D;&#x548C;&#x6CBB;&#x7406;</h4>
<div class="paragraph">
<p>&#x6BCF;&#x7576;&#x516C;&#x53F8;&#x6216;&#x500B;&#x4EBA;&#x5132;&#x5B58;&#x5927;&#x91CF;&#x6BD4;&#x7279;&#x5E63;&#x6642;&#xFF0C;&#x4ED6;&#x5011;&#x61C9;&#x8A72;&#x8003;&#x616E;&#x4F7F;&#x7528;&#x591A;&#x91CD;&#x7C3D;&#x540D;&#x6BD4;&#x7279;&#x5E63;&#x5730;&#x5740;&#x3002;&#x591A;&#x91CD;&#x7C3D;&#x540D;&#x901A;&#x904E;&#x8981;&#x6C42;&#x591A;&#x500B;&#x7C3D;&#x540D;&#x9032;&#x884C;&#x4ED8;&#x6B3E;&#x4F86;&#x89E3;&#x6C7A;&#x8CC7;&#x91D1;&#x5B89;&#x5168;&#x554F;&#x984C;&#x3002;&#x7C3D;&#x540D;&#x5BC6;&#x9470;&#x61C9;&#x5132;&#x5B58;&#x5728;&#x591A;&#x500B;&#x4E0D;&#x540C;&#x4F4D;&#x7F6E;&#xFF0C;&#x4E26;&#x7531;&#x4E0D;&#x540C;&#x4EBA;&#x54E1;&#x63A7;&#x5236;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x516C;&#x53F8;&#x74B0;&#x5883;&#x4E2D;&#xFF0C;&#x5BC6;&#x9470;&#x61C9;&#x8A72;&#x7531;&#x591A;&#x500B;&#x516C;&#x53F8;&#x7BA1;&#x7406;&#x4EBA;&#x54E1;&#x7368;&#x7ACB;&#x751F;&#x6210;&#x4E26;&#x4FDD;&#x5B58;&#xFF0C;&#x4EE5;&#x78BA;&#x4FDD;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x4E0D;&#x6703;&#x640D;&#x5BB3;&#x8CC7;&#x91D1;&#x3002;&#x591A;&#x91CD;&#x7C3D;&#x540D;&#x5730;&#x5740;&#x4E5F;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x5197;&#x9918;&#xFF0C;&#x5373;&#x4E00;&#x500B;&#x4EBA;&#x64C1;&#x6709;&#x591A;&#x500B;&#x5132;&#x5B58;&#x5728;&#x4E0D;&#x540C;&#x4F4D;&#x7F6E;&#x7684;&#x5BC6;&#x9470;&#x3002;</p>
</div>
</div>
<div class="sect3">
<h4 id="___9">&#x751F;&#x5B58;&#x6027;</h4>
<div class="paragraph">
<p>&#x7D93;&#x5E38;&#x88AB;&#x5FFD;&#x8996;&#x7684;&#x4E00;&#x500B;&#x91CD;&#x8981;&#x7684;&#x5B89;&#x5168;&#x56E0;&#x7D20;&#x662F;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x7279;&#x5225;&#x662F;&#x5728;&#x5BC6;&#x9470;&#x6301;&#x6709;&#x8005;&#x7121;&#x80FD;&#x529B;&#x6216;&#x6B7B;&#x4EA1;&#x7684;&#x60C5;&#x6CC1;&#x4E0B;&#x3002;&#x6BD4;&#x7279;&#x5E63;&#x7528;&#x6236;&#x88AB;&#x544A;&#x77E5;&#x4F7F;&#x7528;&#x8907;&#x96DC;&#x7684;&#x5BC6;&#x78BC;&#xFF0C;&#x4E26;&#x4FDD;&#x8B49;&#x4ED6;&#x5011;&#x7684;&#x5BC6;&#x9470;&#x5B89;&#x5168;&#x548C;&#x79C1;&#x5BC6;&#xFF0C;&#x800C;&#x4E0D;&#x8207;&#x4EFB;&#x4F55;&#x4EBA;&#x5206;&#x4EAB;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6236;&#x7121;&#x6CD5;&#x89E3;&#x9396;&#xFF0C;&#x90A3;&#x9EBC;&#x9019;&#x7A2E;&#x505A;&#x6CD5;&#x5E7E;&#x4E4E;&#x4E0D;&#x53EF;&#x80FD;&#x8B93;&#x7528;&#x6236;&#x7684;&#x5BB6;&#x4EBA;&#x6062;&#x5FA9;&#x4EFB;&#x4F55;&#x8CC7;&#x91D1;&#x3002;&#x4E8B;&#x5BE6;&#x4E0A;&#xFF0C;&#x5728;&#x5927;&#x591A;&#x6578;&#x60C5;&#x6CC1;&#x4E0B;&#xFF0C;&#x6BD4;&#x7279;&#x5E63;&#x7528;&#x6236;&#x7684;&#x5BB6;&#x65CF;&#x53EF;&#x80FD;&#x5B8C;&#x5168;&#x4E0D;&#x77E5;&#x9053;&#x6BD4;&#x7279;&#x5E63;&#x8CC7;&#x91D1;&#x7684;&#x5B58;&#x5728;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x5982;&#x679C;&#x4F60;&#x6709;&#x5F88;&#x591A;&#x6BD4;&#x7279;&#x5E63;&#xFF0C;&#x4F60;&#x61C9;&#x8A72;&#x8003;&#x616E;&#x8207;&#x53D7;&#x4FE1;&#x4EFB;&#x7684;&#x89AA;&#x621A;&#x6216;&#x5F8B;&#x5E2B;&#x5206;&#x4EAB;&#x8A2A;&#x554F;&#x7D30;&#x7BC0;&#x3002;&#x53EF;&#x4EE5;&#x901A;&#x904E;&#x5C08;&#x9580;&#x7684;&#x7A31;&#x70BA;&#x201C;&#x6578;&#x5B57;&#x8CC7;&#x7522;&#x57F7;&#x884C;&#x8005;&#x201D;&#x7684;&#x5F8B;&#x5E2B;&#xFF0C;&#x4F7F;&#x7528;&#x591A;&#x91CD;&#x7C3D;&#x540D;&#x8A2A;&#x554F;&#x548C;&#x8CC7;&#x7522;&#x898F;&#x5283;&#x8A2D;&#x7ACB;&#x66F4;&#x5FA9;&#x96DC;&#x7684;&#x751F;&#x5B58;&#x6027;&#x8A08;&#x5283;&#x3002;</p>
</div>
</div>
</div>
<div class="sect2">
<h3 id="___10">&#x7E3D;&#x7D50;</h3>
<div class="paragraph">
<p>&#x6BD4;&#x7279;&#x5E63;&#x662F;&#x4E00;&#x7A2E;&#x5168;&#x65B0;&#x7684;&#xFF0C;&#x524D;&#x6240;&#x672A;&#x6709;&#x7684;&#x8907;&#x96DC;&#x6280;&#x8853;&#x3002;&#x96A8;&#x8457;&#x6642;&#x9593;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x6211;&#x5011;&#x5C07;&#x958B;&#x767C;&#x66F4;&#x597D;&#x7684;&#x5B89;&#x5168;&#x5DE5;&#x5177;&#x548C;&#x5BE6;&#x8E10;&#xFF0C;&#x4F7F;&#x975E;&#x5C08;&#x696D;&#x4EBA;&#x54E1;&#x66F4;&#x5BB9;&#x6613;&#x4F7F;&#x7528;&#x3002;&#x76EE;&#x524D;&#xFF0C;&#x6BD4;&#x7279;&#x5E63;&#x7528;&#x6236;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x9019;&#x88E1;&#x8A0E;&#x8AD6;&#x7684;&#x8A31;&#x591A;&#x6280;&#x5DE7;&#x4F86;&#x4EAB;&#x53D7;&#x5B89;&#x5168;&#x4E14;&#x7121;&#x6545;&#x969C;&#x7684;&#x6BD4;&#x7279;&#x5E63;&#x9AD4;&#x9A57;&#x3002;</p>
</div>
</div>
</div>
</div>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="第十章.html" class="navigation navigation-prev " aria-label="Previous page: 第十章 挖礦和共識">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="第十二章.html" class="navigation navigation-next " aria-label="Next page: 第十二章 區塊鏈應用">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十一章 比特幣安全","level":"1.14","depth":1,"next":{"title":"第十二章 區塊鏈應用","level":"1.15","depth":1,"path":"第十二章.asciidoc","ref":"第十二章.asciidoc","articles":[]},"previous":{"title":"第十章 挖礦和共識","level":"1.13","depth":1,"path":"第十章.asciidoc","ref":"第十章.asciidoc","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"第十一章.asciidoc","mtime":"2019-08-26T12:14:00.818Z","type":"asciidoc"},"gitbook":{"version":"3.2.3","time":"2019-08-26T12:56:48.798Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

